TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
/*
 * TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 * Copyright (c) 2023 Texas Instruments Incorporated
 *
 * All rights reserved not granted herein.
 *
 * Limited License.
 *
 * Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 * license under copyrights and patents it now or hereafter owns or controls to
 * make, have made, use, import, offer to sell and sell ("Utilize") this software
 * subject to the terms herein. With respect to the foregoing patent license,
 * such license is granted solely to the extent that any such patent is necessary
 * to Utilize the software alone. The patent license shall not apply to any
 * combinations which include this software, other than combinations with devices
 * manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 * Redistributions must preserve existing copyright notices and reproduce this license
 * (including the above copyright notice and the disclaimer and (if applicable) source
 * code license limitations below) in the documentation and/or other materials provided
 * with the distribution.
 *
 * Redistribution and use in binary form, without modification, are permitted provided
 * that the following conditions are met:
 * No reverse engineering, decompilation, or disassembly of this software is
 * permitted with respect to any software provided in binary form.
 * Any redistribution and use are licensed by TI for use only with TI Devices.
 * Nothing shall obligate TI to provide you with source code for the software
 * licensed and provided to you in object code.
 *
 * If software source code is provided to you, modification and redistribution of the
 * source code are permitted provided that the following conditions are met:
 * Any redistribution and use of the source code, including any resulting derivative
 * works, are licensed by TI for use only with TI Devices.
 * Any redistribution and use of any object code compiled from the source code
 * and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * DISCLAIMER.
 *
 * THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 * LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef HW_EPWM_REG_H_
#define HW_EPWM_REG_H_

/* ========================================================================== */
/*                             Include Files                                  */
/* ========================================================================== */
#include "Std_Types.h"

#ifdef __cplusplus
extern "C"
{
#endif

/**************************************************************************
* Hardware Region  :
**************************************************************************/
#define PWM_USE_EPWM

/**************************************************************************
* HR PWM Register Overlay Structure
**************************************************************************/

typedef struct {
    volatile uint8  Resv_66[66];
    volatile uint16 HRPWR;
    volatile uint16 HRCAL;
    volatile uint16 HRPRD;
    volatile uint16 HRCNT0;
    volatile uint16 HRCNT1;
    volatile uint16 HRMSTEP;
} Pwm_ottocalRegs;

/**************************************************************************
* Register Overlay Structure
**************************************************************************/

typedef struct {
    volatile uint16 TBCTL;
    volatile uint16 TBCTL2;
    volatile uint16 RESERVED_1;
    volatile uint16 EPWMSYNCINSEL;
    volatile uint16 TBCTR;
    volatile uint16 TBSTS;
    volatile uint16 EPWMSYNCOUTEN;
    volatile uint16 TBCTL3;
    volatile uint16 CMPCTL;
    volatile uint16 CMPCTL2;
    volatile uint16 RESERVED_2[2];
    volatile uint16 DBCTL;
    volatile uint16 DBCTL2;
    volatile uint16 RESERVED_3[2];
    volatile uint16 AQCTL;
    volatile uint16 AQTSRCSEL;
    volatile uint16 RESERVED_4[2];
    volatile uint16 PCCTL;
    volatile uint16 RESERVED_5[3];
    volatile uint16 VCAPCTL;
    volatile uint16 VCNTCFG;
    volatile uint16 RESERVED_6[6];
    volatile uint16 HRCNFG;
    volatile uint16 RESERVED_7;
    volatile uint16 RESERVED_8;
    volatile uint16 RESERVED_9;
    volatile uint16 RESERVED_10;
    volatile uint16 RESERVED_11;
    volatile uint16 RESERVED_12;
    volatile uint16 HRCNFG2;
    volatile uint16 RESERVED_13[5];
    volatile uint16 HRPCTL;
    volatile uint16 TRREM;
    volatile uint16 RESERVED_14[5];
    volatile uint16 GLDCTL;
    volatile uint16 GLDCFG;
    volatile uint16 RESERVED_15[2];
    volatile uint32 EPWMXLINK;
    volatile uint32 EPWMXLINK2;
    volatile uint16 RESERVED_16;
    volatile uint16 ETEST;
    volatile uint16 EPWMREV;
    volatile uint16 HRPWMREV;
    volatile uint16 AQCTLA;
    volatile uint16 AQCTLA2;
    volatile uint16 AQCTLB;
    volatile uint16 AQCTLB2;
    volatile uint16 RESERVED_17[3];
    volatile uint16 AQSFRC;
    volatile uint16 RESERVED_18;
    volatile uint16 AQCSFRC;
    volatile uint16 RESERVED_19[6];
    volatile uint16 DBREDHR;
    volatile uint16 DBRED;
    volatile uint16 DBFEDHR;
    volatile uint16 DBFED;
    volatile uint16 RESERVED_20[12];
    volatile uint32 TBPHS;
    volatile uint16 TBPRDHR;
    volatile uint16 TBPRD;
    volatile uint16 TBPRDHRB;
    volatile uint16 RESERVED_21[5];
    volatile uint32 CMPA;
    volatile uint32 CMPB;
    volatile uint16 RESERVED_22;
    volatile uint16 CMPC;
    volatile uint16 RESERVED_23;
    volatile uint16 CMPD;
    volatile uint16 RESERVED_24[2];
    volatile uint16 GLDCTL2;
    volatile uint16 RESERVED_25[2];
    volatile uint16 SWVDELVAL;
    volatile uint16 RESERVED_26[8];
    volatile uint16 TZSEL;
    volatile uint16 TZSEL2;
    volatile uint16 TZDCSEL;
    volatile uint16 RESERVED_27;
    volatile uint16 TZCTL;
    volatile uint16 TZCTL2;
    volatile uint16 TZCTLDCA;
    volatile uint16 TZCTLDCB;
    volatile uint16 RESERVED_28[5];
    volatile uint16 TZEINT;
    volatile uint16 RESERVED_29[5];
    volatile uint16 TZFLG;
    volatile uint16 TZCBCFLG;
    volatile uint16 TZOSTFLG;
    volatile uint16 RESERVED_30;
    volatile uint16 TZCLR;
    volatile uint16 TZCBCCLR;
    volatile uint16 TZOSTCLR;
    volatile uint16 RESERVED_31;
    volatile uint16 TZFRC;
    volatile uint16 RESERVED_32;
    volatile uint16 TZTRIPOUTSEL;
    volatile uint16 RESERVED_33[6];
    volatile uint16 ETSEL;
    volatile uint16 RESERVED_34;
    volatile uint16 ETPS;
    volatile uint16 RESERVED_35;
    volatile uint16 ETFLG;
    volatile uint16 RESERVED_36;
    volatile uint16 ETCLR;
    volatile uint16 RESERVED_37;
    volatile uint16 ETFRC;
    volatile uint16 RESERVED_38;
    volatile uint16 ETINTPS;
    volatile uint16 RESERVED_39;
    volatile uint16 ETSOCPS;
    volatile uint16 RESERVED_40;
    volatile uint16 ETCNTINITCTL;
    volatile uint16 RESERVED_41;
    volatile uint16 ETCNTINIT;
    volatile uint16 RESERVED_42;
    volatile uint16 ETINTMIXEN;
    volatile uint16 RESERVED_43;
    volatile uint16 ETSOCAMIXEN;
    volatile uint16 RESERVED_44;
    volatile uint16 ETSOCBMIXEN;
    volatile uint16 RESERVED_45[5];
    volatile uint16 DCTRIPSEL;
    volatile uint16 RESERVED_46[2];
    volatile uint16 DCACTL;
    volatile uint16 DCBCTL;
    volatile uint16 RESERVED_47[2];
    volatile uint16 DCFCTL;
    volatile uint16 DCCAPCTL;
    volatile uint16 DCFOFFSET;
    volatile uint16 DCFOFFSETCNT;
    volatile uint16 DCFWINDOW;
    volatile uint16 DCFWINDOWCNT;
    volatile uint16 BLANKPULSEMIXSEL;
    volatile uint16 DCCAPMIXSEL;
    volatile uint16 DCCAP;
    volatile uint16 RESERVED_48[2];
    volatile uint16 DCAHTRIPSEL;
    volatile uint16 DCALTRIPSEL;
    volatile uint16 DCBHTRIPSEL;
    volatile uint16 DCBLTRIPSEL;
    volatile uint16 CAPCTL;
    volatile uint16 CAPGATETRIPSEL;
    volatile uint16 CAPINTRIPSEL;
    volatile uint16 CAPTRIPSEL;
    volatile uint16 RESERVED_49[28];
    volatile uint16 SPARE1;
    volatile uint16 RESERVED_50;
    volatile uint16 SPARE2;
    volatile uint16 RESERVED_51;
    volatile uint32 EPWMLOCK;
    volatile uint16 RESERVED_52;
    volatile uint16 HWVDELVAL;
    volatile uint16 VCNTVAL;
    volatile uint16 RESERVED_53;
    volatile uint8  Resv_1024[512];
    volatile uint32 XCMPCTL1;
    volatile uint32 RESERVED_54[3];
    volatile uint32 XLOADCTL;
    volatile uint32 RESERVED_55;
    volatile uint32 XLOAD;
    volatile uint32 EPWMXLINKXLOAD;
    volatile uint32 XREGSHDW1STS;
    volatile uint32 RESERVED_56;
    volatile uint32 XREGSHDW2STS;
    volatile uint32 RESERVED_57;
    volatile uint32 XREGSHDW3STS;
    volatile uint32 RESERVED_58[115];
    volatile uint32 XCMP1_ACTIVE;
    volatile uint32 XCMP2_ACTIVE;
    volatile uint32 XCMP3_ACTIVE;
    volatile uint32 XCMP4_ACTIVE;
    volatile uint32 XCMP5_ACTIVE;
    volatile uint32 XCMP6_ACTIVE;
    volatile uint32 XCMP7_ACTIVE;
    volatile uint32 XCMP8_ACTIVE;
    volatile uint32 XTBPRD_ACTIVE;
    volatile uint32 RESERVED_59[3];
    volatile uint16 XAQCTLA_ACTIVE;
    volatile uint16 XAQCTLB_ACTIVE;
    volatile uint32 RESERVED_60[4];
    volatile uint32 XMINMAX_ACTIVE;
    volatile uint32 RESERVED_61[14];
    volatile uint32 XCMP1_SHDW1;
    volatile uint32 XCMP2_SHDW1;
    volatile uint32 XCMP3_SHDW1;
    volatile uint32 XCMP4_SHDW1;
    volatile uint32 XCMP5_SHDW1;
    volatile uint32 XCMP6_SHDW1;
    volatile uint32 XCMP7_SHDW1;
    volatile uint32 XCMP8_SHDW1;
    volatile uint32 XTBPRD_SHDW1;
    volatile uint32 RESERVED_62[3];
    volatile uint16 XAQCTLA_SHDW1;
    volatile uint16 XAQCTLB_SHDW1;
    volatile uint16 RESERVED_63[3];
    volatile uint16 CMPC_SHDW1;
    volatile uint16 RESERVED_64;
    volatile uint16 CMPD_SHDW1;
    volatile uint32 RESERVED_65;
    volatile uint32 XMINMAX_SHDW1;
    volatile uint32 RESERVED_66[14];
    volatile uint32 XCMP1_SHDW2;
    volatile uint32 XCMP2_SHDW2;
    volatile uint32 XCMP3_SHDW2;
    volatile uint32 XCMP4_SHDW2;
    volatile uint32 XCMP5_SHDW2;
    volatile uint32 XCMP6_SHDW2;
    volatile uint32 XCMP7_SHDW2;
    volatile uint32 XCMP8_SHDW2;
    volatile uint32 XTBPRD_SHDW2;
    volatile uint32 RESERVED_67[3];
    volatile uint16 XAQCTLA_SHDW2;
    volatile uint16 XAQCTLB_SHDW2;
    volatile uint16 RESERVED_68[3];
    volatile uint16 CMPC_SHDW2;
    volatile uint16 RESERVED_69;
    volatile uint16 CMPD_SHDW2;
    volatile uint32 RESERVED_70;
    volatile uint32 XMINMAX_SHDW2;
    volatile uint32 RESERVED_71[14];
    volatile uint32 XCMP1_SHDW3;
    volatile uint32 XCMP2_SHDW3;
    volatile uint32 XCMP3_SHDW3;
    volatile uint32 XCMP4_SHDW3;
    volatile uint32 XCMP5_SHDW3;
    volatile uint32 XCMP6_SHDW3;
    volatile uint32 XCMP7_SHDW3;
    volatile uint32 XCMP8_SHDW3;
    volatile uint32 XTBPRD_SHDW3;
    volatile uint32 RESERVED_72[3];
    volatile uint16 XAQCTLA_SHDW3;
    volatile uint16 XAQCTLB_SHDW3;
    volatile uint16 RESERVED_73[3];
    volatile uint16 CMPC_SHDW3;
    volatile uint16 RESERVED_74;
    volatile uint16 CMPD_SHDW3;
    volatile uint32 RESERVED_75;
    volatile uint32 XMINMAX_SHDW3;
    volatile uint32 RESERVED_76[14];
    volatile uint32 DECTL;
    volatile uint32 DECOMPSEL;
    volatile uint32 DEACTCTL;
    volatile uint32 DESTS;
    volatile uint32 DEFRC;
    volatile uint32 DECLR;
    volatile uint32 RESERVED_77[2];
    volatile uint32 DEMONCNT;
    volatile uint32 DEMONCTL;
    volatile uint32 DEMONSTEP;
    volatile uint32 DEMONTHRES;
    volatile uint32 RESERVED_78[4];
    volatile uint8  Resv_3072[960];
    volatile uint32 MINDBCFG;
    volatile uint32 MINDBDLY;
    volatile uint32 RESERVED_79[6];
    volatile uint32 LUTCTLA;
    volatile uint32 LUTCTLB;
    volatile uint32 RESERVED_80[6];
} Pwm_epwmRegs;


/**************************************************************************
* Register Macros
**************************************************************************/

