TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_TBCTL2_PRDLDSYNC_MASK                                         (0xC000U)
#define PWM_EPWM_TBCTL2_PRDLDSYNC_SHIFT                                        (0x000EU)
#define PWM_EPWM_TBCTL2_PRDLDSYNC_RESETVAL                                     (0x0000U)
#define PWM_EPWM_TBCTL2_PRDLDSYNC_MAX                                          (0x0003U)

#define PWM_EPWM_TBCTL2_RESETVAL                                               (0x0000U)

/* RESERVED_1 */

#define PWM_EPWM_RESERVED_1_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_1_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_1_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_1_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_1_RESETVAL                                           (0x0000U)

/* EPWMSYNCINSEL */

#define PWM_EPWM_EPWMSYNCINSEL_SEL_MASK                                        (0x007FU)
#define PWM_EPWM_EPWMSYNCINSEL_SEL_SHIFT                                       (0x0000U)
#define PWM_EPWM_EPWMSYNCINSEL_SEL_RESETVAL                                    (0x0001U)
#define PWM_EPWM_EPWMSYNCINSEL_SEL_MAX                                         (0x007FU)

#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_MASK                                 (0xFF80U)
#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_SHIFT                                (0x0007U)
#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_RESETVAL                             (0x0000U)
#define PWM_EPWM_EPWMSYNCINSEL_RESERVED_1_MAX                                  (0x01FFU)

#define PWM_EPWM_EPWMSYNCINSEL_RESETVAL                                        (0x0001U)

/* TBCTR */

#define PWM_EPWM_TBCTR_TBCTR_MASK                                              (0xFFFFU)
#define PWM_EPWM_TBCTR_TBCTR_SHIFT                                             (0x0000U)
#define PWM_EPWM_TBCTR_TBCTR_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TBCTR_TBCTR_MAX                                               (0xFFFFU)

#define PWM_EPWM_TBCTR_RESETVAL                                                (0x0000U)

/* TBSTS */

#define PWM_EPWM_TBSTS_CTRDIR_MASK                                             (0x0001U)
#define PWM_EPWM_TBSTS_CTRDIR_SHIFT                                            (0x0000U)
#define PWM_EPWM_TBSTS_CTRDIR_RESETVAL                                         (0x0001U)
#define PWM_EPWM_TBSTS_CTRDIR_MAX                                              (0x0001U)

#define PWM_EPWM_TBSTS_SYNCI_MASK                                              (0x0002U)
#define PWM_EPWM_TBSTS_SYNCI_SHIFT                                             (0x0001U)
#define PWM_EPWM_TBSTS_SYNCI_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TBSTS_SYNCI_MAX                                               (0x0001U)

#define PWM_EPWM_TBSTS_CTRMAX_MASK                                             (0x0004U)
#define PWM_EPWM_TBSTS_CTRMAX_SHIFT                                            (0x0002U)
#define PWM_EPWM_TBSTS_CTRMAX_RESETVAL                                         (0x0000U)
#define PWM_EPWM_TBSTS_CTRMAX_MAX                                              (0x0001U)

#define PWM_EPWM_TBSTS_RESERVED_1_MASK                                         (0xFFF8U)
#define PWM_EPWM_TBSTS_RESERVED_1_SHIFT                                        (0x0003U)
#define PWM_EPWM_TBSTS_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_TBSTS_RESERVED_1_MAX                                          (0x1FFFU)

#define PWM_EPWM_TBSTS_RESETVAL                                                (0x0001U)

/* EPWMSYNCOUTEN */

#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_MASK                                       (0x0001U)
#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_SHIFT                                      (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_RESETVAL                                   (0x0001U)
#define PWM_EPWM_EPWMSYNCOUTEN_SWEN_MAX                                        (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_MASK                                     (0x0002U)
#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_SHIFT                                    (0x0001U)
#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_RESETVAL                                 (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_ZEROEN_MAX                                      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_MASK                                     (0x0004U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_SHIFT                                    (0x0002U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_RESETVAL                                 (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPBEN_MAX                                      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_MASK                                     (0x0008U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_SHIFT                                    (0x0003U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_RESETVAL                                 (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPCEN_MAX                                      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_MASK                                     (0x0010U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_SHIFT                                    (0x0004U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_RESETVAL                                 (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_CMPDEN_MAX                                      (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_MASK                                  (0x0020U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_SHIFT                                 (0x0005U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_RESETVAL                              (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCAEVT1EN_MAX                                   (0x0001U)

#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_MASK                                  (0x0040U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_SHIFT                                 (0x0006U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_RESETVAL                              (0x0000U)
#define PWM_EPWM_EPWMSYNCOUTEN_DCBEVT1EN_MAX                                   (0x0001U)

