TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
/* DBCTL2 */

#define PWM_EPWM_DBCTL2_LOADDBCTLMODE_MASK                                     (0x0003U)
#define PWM_EPWM_DBCTL2_LOADDBCTLMODE_SHIFT                                    (0x0000U)
#define PWM_EPWM_DBCTL2_LOADDBCTLMODE_RESETVAL                                 (0x0000U)
#define PWM_EPWM_DBCTL2_LOADDBCTLMODE_MAX                                      (0x0003U)

#define PWM_EPWM_DBCTL2_SHDWDBCTLMODE_MASK                                     (0x0004U)
#define PWM_EPWM_DBCTL2_SHDWDBCTLMODE_SHIFT                                    (0x0002U)
#define PWM_EPWM_DBCTL2_SHDWDBCTLMODE_RESETVAL                                 (0x0000U)
#define PWM_EPWM_DBCTL2_SHDWDBCTLMODE_MAX                                      (0x0001U)

#define PWM_EPWM_DBCTL2_RESERVED_1_MASK                                        (0xFFF8U)
#define PWM_EPWM_DBCTL2_RESERVED_1_SHIFT                                       (0x0003U)
#define PWM_EPWM_DBCTL2_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_DBCTL2_RESERVED_1_MAX                                         (0x1FFFU)

#define PWM_EPWM_DBCTL2_RESETVAL                                               (0x0000U)

/* RESERVED_3 */

#define PWM_EPWM_RESERVED_3_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_3_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_3_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_3_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_3_RESETVAL                                           (0x0000U)

/* AQCTL */

#define PWM_EPWM_AQCTL_LDAQAMODE_MASK                                          (0x0003U)
#define PWM_EPWM_AQCTL_LDAQAMODE_SHIFT                                         (0x0000U)
#define PWM_EPWM_AQCTL_LDAQAMODE_RESETVAL                                      (0x0000U)
#define PWM_EPWM_AQCTL_LDAQAMODE_MAX                                           (0x0003U)

#define PWM_EPWM_AQCTL_LDAQBMODE_MASK                                          (0x000CU)
#define PWM_EPWM_AQCTL_LDAQBMODE_SHIFT                                         (0x0002U)
#define PWM_EPWM_AQCTL_LDAQBMODE_RESETVAL                                      (0x0000U)
#define PWM_EPWM_AQCTL_LDAQBMODE_MAX                                           (0x0003U)

#define PWM_EPWM_AQCTL_SHDWAQAMODE_MASK                                        (0x0010U)
#define PWM_EPWM_AQCTL_SHDWAQAMODE_SHIFT                                       (0x0004U)
#define PWM_EPWM_AQCTL_SHDWAQAMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_AQCTL_SHDWAQAMODE_MAX                                         (0x0001U)

#define PWM_EPWM_AQCTL_RESERVED_1_MASK                                         (0x0020U)
#define PWM_EPWM_AQCTL_RESERVED_1_SHIFT                                        (0x0005U)
#define PWM_EPWM_AQCTL_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_AQCTL_RESERVED_1_MAX                                          (0x0001U)

#define PWM_EPWM_AQCTL_SHDWAQBMODE_MASK                                        (0x0040U)
#define PWM_EPWM_AQCTL_SHDWAQBMODE_SHIFT                                       (0x0006U)
#define PWM_EPWM_AQCTL_SHDWAQBMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_AQCTL_SHDWAQBMODE_MAX                                         (0x0001U)

#define PWM_EPWM_AQCTL_RESERVED_2_MASK                                         (0x0080U)
#define PWM_EPWM_AQCTL_RESERVED_2_SHIFT                                        (0x0007U)
#define PWM_EPWM_AQCTL_RESERVED_2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_AQCTL_RESERVED_2_MAX                                          (0x0001U)

#define PWM_EPWM_AQCTL_LDAQASYNC_MASK                                          (0x0300U)
#define PWM_EPWM_AQCTL_LDAQASYNC_SHIFT                                         (0x0008U)
#define PWM_EPWM_AQCTL_LDAQASYNC_RESETVAL                                      (0x0000U)
#define PWM_EPWM_AQCTL_LDAQASYNC_MAX                                           (0x0003U)

#define PWM_EPWM_AQCTL_LDAQBSYNC_MASK                                          (0x0C00U)
#define PWM_EPWM_AQCTL_LDAQBSYNC_SHIFT                                         (0x000AU)
#define PWM_EPWM_AQCTL_LDAQBSYNC_RESETVAL                                      (0x0000U)
#define PWM_EPWM_AQCTL_LDAQBSYNC_MAX                                           (0x0003U)

#define PWM_EPWM_AQCTL_RESERVED_3_MASK                                         (0xF000U)
#define PWM_EPWM_AQCTL_RESERVED_3_SHIFT                                        (0x000CU)
#define PWM_EPWM_AQCTL_RESERVED_3_RESETVAL                                     (0x0000U)
#define PWM_EPWM_AQCTL_RESERVED_3_MAX                                          (0x000FU)

#define PWM_EPWM_AQCTL_RESETVAL                                                (0x0000U)

/* AQTSRCSEL */

#define PWM_EPWM_AQTSRCSEL_T1SEL_MASK                                          (0x000FU)
#define PWM_EPWM_AQTSRCSEL_T1SEL_SHIFT                                         (0x0000U)
#define PWM_EPWM_AQTSRCSEL_T1SEL_RESETVAL                                      (0x0000U)
#define PWM_EPWM_AQTSRCSEL_T1SEL_MAX                                           (0x000FU)

#define PWM_EPWM_AQTSRCSEL_T2SEL_MASK                                          (0x00F0U)
#define PWM_EPWM_AQTSRCSEL_T2SEL_SHIFT                                         (0x0004U)
#define PWM_EPWM_AQTSRCSEL_T2SEL_RESETVAL                                      (0x0000U)
#define PWM_EPWM_AQTSRCSEL_T2SEL_MAX                                           (0x000FU)

#define PWM_EPWM_AQTSRCSEL_RESERVED_1_MASK                                     (0xFF00U)
#define PWM_EPWM_AQTSRCSEL_RESERVED_1_SHIFT                                    (0x0008U)
#define PWM_EPWM_AQTSRCSEL_RESERVED_1_RESETVAL                                 (0x0000U)
#define PWM_EPWM_AQTSRCSEL_RESERVED_1_MAX                                      (0x00FFU)

#define PWM_EPWM_AQTSRCSEL_RESETVAL                                            (0x0000U)

/* RESERVED_4 */

