TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_RESERVED_4_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_4_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_4_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_4_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_4_RESETVAL                                           (0x0000U)

/* PCCTL */

#define PWM_EPWM_PCCTL_CHPEN_MASK                                              (0x0001U)
#define PWM_EPWM_PCCTL_CHPEN_SHIFT                                             (0x0000U)
#define PWM_EPWM_PCCTL_CHPEN_RESETVAL                                          (0x0000U)
#define PWM_EPWM_PCCTL_CHPEN_MAX                                               (0x0001U)

#define PWM_EPWM_PCCTL_OSHTWTH_MASK                                            (0x001EU)
#define PWM_EPWM_PCCTL_OSHTWTH_SHIFT                                           (0x0001U)
#define PWM_EPWM_PCCTL_OSHTWTH_RESETVAL                                        (0x0000U)
#define PWM_EPWM_PCCTL_OSHTWTH_MAX                                             (0x000FU)

#define PWM_EPWM_PCCTL_CHPFREQ_MASK                                            (0x00E0U)
#define PWM_EPWM_PCCTL_CHPFREQ_SHIFT                                           (0x0005U)
#define PWM_EPWM_PCCTL_CHPFREQ_RESETVAL                                        (0x0000U)
#define PWM_EPWM_PCCTL_CHPFREQ_MAX                                             (0x0007U)

#define PWM_EPWM_PCCTL_CHPDUTY_MASK                                            (0x0700U)
#define PWM_EPWM_PCCTL_CHPDUTY_SHIFT                                           (0x0008U)
#define PWM_EPWM_PCCTL_CHPDUTY_RESETVAL                                        (0x0000U)
#define PWM_EPWM_PCCTL_CHPDUTY_MAX                                             (0x0007U)

#define PWM_EPWM_PCCTL_RESERVED_1_MASK                                         (0xF800U)
#define PWM_EPWM_PCCTL_RESERVED_1_SHIFT                                        (0x000BU)
#define PWM_EPWM_PCCTL_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_PCCTL_RESERVED_1_MAX                                          (0x001FU)

#define PWM_EPWM_PCCTL_RESETVAL                                                (0x0000U)

/* RESERVED_5 */

#define PWM_EPWM_RESERVED_5_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_5_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_5_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_5_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_5_RESETVAL                                           (0x0000U)

/* VCAPCTL */

#define PWM_EPWM_VCAPCTL_VCAPE_MASK                                            (0x0001U)
#define PWM_EPWM_VCAPCTL_VCAPE_SHIFT                                           (0x0000U)
#define PWM_EPWM_VCAPCTL_VCAPE_RESETVAL                                        (0x0000U)
#define PWM_EPWM_VCAPCTL_VCAPE_MAX                                             (0x0001U)

#define PWM_EPWM_VCAPCTL_VCAPSTART_MASK                                        (0x0002U)
#define PWM_EPWM_VCAPCTL_VCAPSTART_SHIFT                                       (0x0001U)
#define PWM_EPWM_VCAPCTL_VCAPSTART_RESETVAL                                    (0x0000U)
#define PWM_EPWM_VCAPCTL_VCAPSTART_MAX                                         (0x0001U)

#define PWM_EPWM_VCAPCTL_TRIGSEL_MASK                                          (0x001CU)
#define PWM_EPWM_VCAPCTL_TRIGSEL_SHIFT                                         (0x0002U)
#define PWM_EPWM_VCAPCTL_TRIGSEL_RESETVAL                                      (0x0000U)
#define PWM_EPWM_VCAPCTL_TRIGSEL_MAX                                           (0x0007U)

#define PWM_EPWM_VCAPCTL_RESERVED_1_MASK                                       (0x0060U)
#define PWM_EPWM_VCAPCTL_RESERVED_1_SHIFT                                      (0x0005U)
#define PWM_EPWM_VCAPCTL_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_VCAPCTL_RESERVED_1_MAX                                        (0x0003U)

#define PWM_EPWM_VCAPCTL_VDELAYDIV_MASK                                        (0x0380U)
#define PWM_EPWM_VCAPCTL_VDELAYDIV_SHIFT                                       (0x0007U)
#define PWM_EPWM_VCAPCTL_VDELAYDIV_RESETVAL                                    (0x0000U)
#define PWM_EPWM_VCAPCTL_VDELAYDIV_MAX                                         (0x0007U)

#define PWM_EPWM_VCAPCTL_EDGEFILTDLYSEL_MASK                                   (0x0400U)
#define PWM_EPWM_VCAPCTL_EDGEFILTDLYSEL_SHIFT                                  (0x000AU)
#define PWM_EPWM_VCAPCTL_EDGEFILTDLYSEL_RESETVAL                               (0x0000U)
#define PWM_EPWM_VCAPCTL_EDGEFILTDLYSEL_MAX                                    (0x0001U)

#define PWM_EPWM_VCAPCTL_RESERVED_2_MASK                                       (0xF800U)
#define PWM_EPWM_VCAPCTL_RESERVED_2_SHIFT                                      (0x000BU)
#define PWM_EPWM_VCAPCTL_RESERVED_2_RESETVAL                                   (0x0000U)
#define PWM_EPWM_VCAPCTL_RESERVED_2_MAX                                        (0x001FU)

#define PWM_EPWM_VCAPCTL_RESETVAL                                              (0x0000U)

/* VCNTCFG */

#define PWM_EPWM_VCNTCFG_STARTEDGE_MASK                                        (0x000FU)
#define PWM_EPWM_VCNTCFG_STARTEDGE_SHIFT                                       (0x0000U)
#define PWM_EPWM_VCNTCFG_STARTEDGE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_VCNTCFG_STARTEDGE_MAX                                         (0x000FU)

#define PWM_EPWM_VCNTCFG_RESERVED_1_MASK                                       (0x0070U)
#define PWM_EPWM_VCNTCFG_RESERVED_1_SHIFT                                      (0x0004U)
#define PWM_EPWM_VCNTCFG_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_VCNTCFG_RESERVED_1_MAX                                        (0x0007U)

#define PWM_EPWM_VCNTCFG_STARTEDGESTS_MASK                                     (0x0080U)
#define PWM_EPWM_VCNTCFG_STARTEDGESTS_SHIFT                                    (0x0007U)
#define PWM_EPWM_VCNTCFG_STARTEDGESTS_RESETVAL                                 (0x0000U)
#define PWM_EPWM_VCNTCFG_STARTEDGESTS_MAX                                      (0x0001U)

#define PWM_EPWM_VCNTCFG_STOPEDGE_MASK                                         (0x0F00U)
#define PWM_EPWM_VCNTCFG_STOPEDGE_SHIFT                                        (0x0008U)
#define PWM_EPWM_VCNTCFG_STOPEDGE_RESETVAL                                     (0x0000U)
#define PWM_EPWM_VCNTCFG_STOPEDGE_MAX                                          (0x000FU)

