TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_VCNTCFG_RESERVED_2_MASK                                       (0x7000U)
#define PWM_EPWM_VCNTCFG_RESERVED_2_SHIFT                                      (0x000CU)
#define PWM_EPWM_VCNTCFG_RESERVED_2_RESETVAL                                   (0x0000U)
#define PWM_EPWM_VCNTCFG_RESERVED_2_MAX                                        (0x0007U)

#define PWM_EPWM_VCNTCFG_STOPEDGESTS_MASK                                      (0x8000U)
#define PWM_EPWM_VCNTCFG_STOPEDGESTS_SHIFT                                     (0x000FU)
#define PWM_EPWM_VCNTCFG_STOPEDGESTS_RESETVAL                                  (0x0000U)
#define PWM_EPWM_VCNTCFG_STOPEDGESTS_MAX                                       (0x0001U)

#define PWM_EPWM_VCNTCFG_RESETVAL                                              (0x0000U)

/* RESERVED_6 */

#define PWM_EPWM_RESERVED_6_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_6_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_6_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_6_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_6_RESETVAL                                           (0x0000U)

/* HRCNFG */

#define PWM_EPWM_HRCNFG_EDGMODE_MASK                                           (0x0003U)
#define PWM_EPWM_HRCNFG_EDGMODE_SHIFT                                          (0x0000U)
#define PWM_EPWM_HRCNFG_EDGMODE_RESETVAL                                       (0x0000U)
#define PWM_EPWM_HRCNFG_EDGMODE_MAX                                            (0x0003U)

#define PWM_EPWM_HRCNFG_CTLMODE_MASK                                           (0x0004U)
#define PWM_EPWM_HRCNFG_CTLMODE_SHIFT                                          (0x0002U)
#define PWM_EPWM_HRCNFG_CTLMODE_RESETVAL                                       (0x0000U)
#define PWM_EPWM_HRCNFG_CTLMODE_MAX                                            (0x0001U)

#define PWM_EPWM_HRCNFG_HRLOAD_MASK                                            (0x0018U)
#define PWM_EPWM_HRCNFG_HRLOAD_SHIFT                                           (0x0003U)
#define PWM_EPWM_HRCNFG_HRLOAD_RESETVAL                                        (0x0000U)
#define PWM_EPWM_HRCNFG_HRLOAD_MAX                                             (0x0003U)

#define PWM_EPWM_HRCNFG_SELOUTB_MASK                                           (0x0020U)
#define PWM_EPWM_HRCNFG_SELOUTB_SHIFT                                          (0x0005U)
#define PWM_EPWM_HRCNFG_SELOUTB_RESETVAL                                       (0x0000U)
#define PWM_EPWM_HRCNFG_SELOUTB_MAX                                            (0x0001U)

#define PWM_EPWM_HRCNFG_AUTOCONV_MASK                                          (0x0040U)
#define PWM_EPWM_HRCNFG_AUTOCONV_SHIFT                                         (0x0006U)
#define PWM_EPWM_HRCNFG_AUTOCONV_RESETVAL                                      (0x0000U)
#define PWM_EPWM_HRCNFG_AUTOCONV_MAX                                           (0x0001U)

#define PWM_EPWM_HRCNFG_SWAPAB_MASK                                            (0x0080U)
#define PWM_EPWM_HRCNFG_SWAPAB_SHIFT                                           (0x0007U)
#define PWM_EPWM_HRCNFG_SWAPAB_RESETVAL                                        (0x0000U)
#define PWM_EPWM_HRCNFG_SWAPAB_MAX                                             (0x0001U)

#define PWM_EPWM_HRCNFG_EDGMODEB_MASK                                          (0x0300U)
#define PWM_EPWM_HRCNFG_EDGMODEB_SHIFT                                         (0x0008U)
#define PWM_EPWM_HRCNFG_EDGMODEB_RESETVAL                                      (0x0000U)
#define PWM_EPWM_HRCNFG_EDGMODEB_MAX                                           (0x0003U)

#define PWM_EPWM_HRCNFG_CTLMODEB_MASK                                          (0x0400U)
#define PWM_EPWM_HRCNFG_CTLMODEB_SHIFT                                         (0x000AU)
#define PWM_EPWM_HRCNFG_CTLMODEB_RESETVAL                                      (0x0000U)
#define PWM_EPWM_HRCNFG_CTLMODEB_MAX                                           (0x0001U)

#define PWM_EPWM_HRCNFG_HRLOADB_MASK                                           (0x1800U)
#define PWM_EPWM_HRCNFG_HRLOADB_SHIFT                                          (0x000BU)
#define PWM_EPWM_HRCNFG_HRLOADB_RESETVAL                                       (0x0000U)
#define PWM_EPWM_HRCNFG_HRLOADB_MAX                                            (0x0003U)

#define PWM_EPWM_HRCNFG_RESERVED_1_MASK                                        (0x2000U)
#define PWM_EPWM_HRCNFG_RESERVED_1_SHIFT                                       (0x000DU)
#define PWM_EPWM_HRCNFG_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_HRCNFG_RESERVED_1_MAX                                         (0x0001U)

#define PWM_EPWM_HRCNFG_LINESEL_MASK                                           (0xC000U)
#define PWM_EPWM_HRCNFG_LINESEL_SHIFT                                          (0x000EU)
#define PWM_EPWM_HRCNFG_LINESEL_RESETVAL                                       (0x0000U)
#define PWM_EPWM_HRCNFG_LINESEL_MAX                                            (0x0003U)

#define PWM_EPWM_HRCNFG_RESETVAL                                               (0x0000U)

/* RESERVED_7 */

#define PWM_EPWM_RESERVED_7_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_7_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_7_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_7_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_7_RESETVAL                                           (0x0000U)

/* RESERVED_8 */

#define PWM_EPWM_RESERVED_8_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_8_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_8_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_8_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_8_RESETVAL                                           (0x0000U)

