TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_HRPCTL_PWMSYNCSELX_MASK                                       (0x0070U)
#define PWM_EPWM_HRPCTL_PWMSYNCSELX_SHIFT                                      (0x0004U)
#define PWM_EPWM_HRPCTL_PWMSYNCSELX_RESETVAL                                   (0x0000U)
#define PWM_EPWM_HRPCTL_PWMSYNCSELX_MAX                                        (0x0007U)

#define PWM_EPWM_HRPCTL_RESERVED_1_MASK                                        (0xFF80U)
#define PWM_EPWM_HRPCTL_RESERVED_1_SHIFT                                       (0x0007U)
#define PWM_EPWM_HRPCTL_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_HRPCTL_RESERVED_1_MAX                                         (0x01FFU)

#define PWM_EPWM_HRPCTL_RESETVAL                                               (0x0000U)

/* TRREM */

#define PWM_EPWM_TRREM_TRREM_MASK                                              (0x07FFU)
#define PWM_EPWM_TRREM_TRREM_SHIFT                                             (0x0000U)
#define PWM_EPWM_TRREM_TRREM_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TRREM_TRREM_MAX                                               (0x07FFU)

#define PWM_EPWM_TRREM_RESERVED_1_MASK                                         (0xF800U)
#define PWM_EPWM_TRREM_RESERVED_1_SHIFT                                        (0x000BU)
#define PWM_EPWM_TRREM_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_TRREM_RESERVED_1_MAX                                          (0x001FU)

#define PWM_EPWM_TRREM_RESETVAL                                                (0x0000U)

/* RESERVED_14 */

#define PWM_EPWM_RESERVED_14_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_14_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_14_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_14_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_14_RESETVAL                                          (0x0000U)

/* GLDCTL */

#define PWM_EPWM_GLDCTL_GLD_MASK                                               (0x0001U)
#define PWM_EPWM_GLDCTL_GLD_SHIFT                                              (0x0000U)
#define PWM_EPWM_GLDCTL_GLD_RESETVAL                                           (0x0000U)
#define PWM_EPWM_GLDCTL_GLD_MAX                                                (0x0001U)

#define PWM_EPWM_GLDCTL_GLDMODE_MASK                                           (0x001EU)
#define PWM_EPWM_GLDCTL_GLDMODE_SHIFT                                          (0x0001U)
#define PWM_EPWM_GLDCTL_GLDMODE_RESETVAL                                       (0x0000U)
#define PWM_EPWM_GLDCTL_GLDMODE_MAX                                            (0x000FU)

#define PWM_EPWM_GLDCTL_OSHTMODE_MASK                                          (0x0020U)
#define PWM_EPWM_GLDCTL_OSHTMODE_SHIFT                                         (0x0005U)
#define PWM_EPWM_GLDCTL_OSHTMODE_RESETVAL                                      (0x0000U)
#define PWM_EPWM_GLDCTL_OSHTMODE_MAX                                           (0x0001U)

#define PWM_EPWM_GLDCTL_RESERVED_1_MASK                                        (0x0040U)
#define PWM_EPWM_GLDCTL_RESERVED_1_SHIFT                                       (0x0006U)
#define PWM_EPWM_GLDCTL_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_GLDCTL_RESERVED_1_MAX                                         (0x0001U)

#define PWM_EPWM_GLDCTL_GLDPRD_MASK                                            (0x0380U)
#define PWM_EPWM_GLDCTL_GLDPRD_SHIFT                                           (0x0007U)
#define PWM_EPWM_GLDCTL_GLDPRD_RESETVAL                                        (0x0000U)
#define PWM_EPWM_GLDCTL_GLDPRD_MAX                                             (0x0007U)

#define PWM_EPWM_GLDCTL_GLDCNT_MASK                                            (0x1C00U)
#define PWM_EPWM_GLDCTL_GLDCNT_SHIFT                                           (0x000AU)
#define PWM_EPWM_GLDCTL_GLDCNT_RESETVAL                                        (0x0000U)
#define PWM_EPWM_GLDCTL_GLDCNT_MAX                                             (0x0007U)

#define PWM_EPWM_GLDCTL_RESERVED_2_MASK                                        (0xE000U)
#define PWM_EPWM_GLDCTL_RESERVED_2_SHIFT                                       (0x000DU)
#define PWM_EPWM_GLDCTL_RESERVED_2_RESETVAL                                    (0x0000U)
#define PWM_EPWM_GLDCTL_RESERVED_2_MAX                                         (0x0007U)

#define PWM_EPWM_GLDCTL_RESETVAL                                               (0x0000U)

/* GLDCFG */

#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_MASK                                     (0x0001U)
#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_SHIFT                                    (0x0000U)
#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_RESETVAL                                 (0x0000U)
#define PWM_EPWM_GLDCFG_TBPRD_TBPRDHR_MAX                                      (0x0001U)

#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_MASK                                       (0x0002U)
#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_SHIFT                                      (0x0001U)
#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_RESETVAL                                   (0x0000U)
#define PWM_EPWM_GLDCFG_CMPA_CMPAHR_MAX                                        (0x0001U)

#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_MASK                                       (0x0004U)
#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_SHIFT                                      (0x0002U)
#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_RESETVAL                                   (0x0000U)
#define PWM_EPWM_GLDCFG_CMPB_CMPBHR_MAX                                        (0x0001U)

#define PWM_EPWM_GLDCFG_CMPC_MASK                                              (0x0008U)
#define PWM_EPWM_GLDCFG_CMPC_SHIFT                                             (0x0003U)
#define PWM_EPWM_GLDCFG_CMPC_RESETVAL                                          (0x0000U)
#define PWM_EPWM_GLDCFG_CMPC_MAX                                               (0x0001U)

#define PWM_EPWM_GLDCFG_CMPD_MASK                                              (0x0010U)
#define PWM_EPWM_GLDCFG_CMPD_SHIFT                                             (0x0004U)
#define PWM_EPWM_GLDCFG_CMPD_RESETVAL                                          (0x0000U)
#define PWM_EPWM_GLDCFG_CMPD_MAX                                               (0x0001U)

#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_MASK                                     (0x0020U)
#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_SHIFT                                    (0x0005U)
#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_RESETVAL                                 (0x0000U)
#define PWM_EPWM_GLDCFG_DBRED_DBREDHR_MAX                                      (0x0001U)

