TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_AQSFRC_ACTSFA_MASK                                            (0x0003U)
#define PWM_EPWM_AQSFRC_ACTSFA_SHIFT                                           (0x0000U)
#define PWM_EPWM_AQSFRC_ACTSFA_RESETVAL                                        (0x0000U)
#define PWM_EPWM_AQSFRC_ACTSFA_MAX                                             (0x0003U)

#define PWM_EPWM_AQSFRC_OTSFA_MASK                                             (0x0004U)
#define PWM_EPWM_AQSFRC_OTSFA_SHIFT                                            (0x0002U)
#define PWM_EPWM_AQSFRC_OTSFA_RESETVAL                                         (0x0000U)
#define PWM_EPWM_AQSFRC_OTSFA_MAX                                              (0x0001U)

#define PWM_EPWM_AQSFRC_ACTSFB_MASK                                            (0x0018U)
#define PWM_EPWM_AQSFRC_ACTSFB_SHIFT                                           (0x0003U)
#define PWM_EPWM_AQSFRC_ACTSFB_RESETVAL                                        (0x0000U)
#define PWM_EPWM_AQSFRC_ACTSFB_MAX                                             (0x0003U)

#define PWM_EPWM_AQSFRC_OTSFB_MASK                                             (0x0020U)
#define PWM_EPWM_AQSFRC_OTSFB_SHIFT                                            (0x0005U)
#define PWM_EPWM_AQSFRC_OTSFB_RESETVAL                                         (0x0000U)
#define PWM_EPWM_AQSFRC_OTSFB_MAX                                              (0x0001U)

#define PWM_EPWM_AQSFRC_RLDCSF_MASK                                            (0x00C0U)
#define PWM_EPWM_AQSFRC_RLDCSF_SHIFT                                           (0x0006U)
#define PWM_EPWM_AQSFRC_RLDCSF_RESETVAL                                        (0x0000U)
#define PWM_EPWM_AQSFRC_RLDCSF_MAX                                             (0x0003U)

#define PWM_EPWM_AQSFRC_RESERVED_1_MASK                                        (0xFF00U)
#define PWM_EPWM_AQSFRC_RESERVED_1_SHIFT                                       (0x0008U)
#define PWM_EPWM_AQSFRC_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_AQSFRC_RESERVED_1_MAX                                         (0x00FFU)

#define PWM_EPWM_AQSFRC_RESETVAL                                               (0x0000U)

/* RESERVED_18 */

#define PWM_EPWM_RESERVED_18_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_18_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_18_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_18_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_18_RESETVAL                                          (0x0000U)

/* AQCSFRC */

#define PWM_EPWM_AQCSFRC_CSFA_MASK                                             (0x0003U)
#define PWM_EPWM_AQCSFRC_CSFA_SHIFT                                            (0x0000U)
#define PWM_EPWM_AQCSFRC_CSFA_RESETVAL                                         (0x0000U)
#define PWM_EPWM_AQCSFRC_CSFA_MAX                                              (0x0003U)

#define PWM_EPWM_AQCSFRC_CSFB_MASK                                             (0x000CU)
#define PWM_EPWM_AQCSFRC_CSFB_SHIFT                                            (0x0002U)
#define PWM_EPWM_AQCSFRC_CSFB_RESETVAL                                         (0x0000U)
#define PWM_EPWM_AQCSFRC_CSFB_MAX                                              (0x0003U)

#define PWM_EPWM_AQCSFRC_RESERVED_1_MASK                                       (0xFFF0U)
#define PWM_EPWM_AQCSFRC_RESERVED_1_SHIFT                                      (0x0004U)
#define PWM_EPWM_AQCSFRC_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_AQCSFRC_RESERVED_1_MAX                                        (0x0FFFU)

#define PWM_EPWM_AQCSFRC_RESETVAL                                              (0x0000U)

/* RESERVED_19 */

#define PWM_EPWM_RESERVED_19_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_19_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_19_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_19_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_19_RESETVAL                                          (0x0000U)

/* DBREDHR */

#define PWM_EPWM_DBREDHR_RESERVED_1_MASK                                       (0x0001U)
#define PWM_EPWM_DBREDHR_RESERVED_1_SHIFT                                      (0x0000U)
#define PWM_EPWM_DBREDHR_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_DBREDHR_RESERVED_1_MAX                                        (0x0001U)

#define PWM_EPWM_DBREDHR_DBREDHR_DELAY_MASK                                    (0x00FEU)
#define PWM_EPWM_DBREDHR_DBREDHR_DELAY_SHIFT                                   (0x0001U)
#define PWM_EPWM_DBREDHR_DBREDHR_DELAY_RESETVAL                                (0x0000U)
#define PWM_EPWM_DBREDHR_DBREDHR_DELAY_MAX                                     (0x007FU)

#define PWM_EPWM_DBREDHR_RESERVED_2_MASK                                       (0x0100U)
#define PWM_EPWM_DBREDHR_RESERVED_2_SHIFT                                      (0x0008U)
#define PWM_EPWM_DBREDHR_RESERVED_2_RESETVAL                                   (0x0000U)
#define PWM_EPWM_DBREDHR_RESERVED_2_MAX                                        (0x0001U)

#define PWM_EPWM_DBREDHR_DBREDHR_MASK                                          (0xFE00U)
#define PWM_EPWM_DBREDHR_DBREDHR_SHIFT                                         (0x0009U)
#define PWM_EPWM_DBREDHR_DBREDHR_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DBREDHR_DBREDHR_MAX                                           (0x007FU)

#define PWM_EPWM_DBREDHR_RESETVAL                                              (0x0000U)

/* DBRED */

#define PWM_EPWM_DBRED_DBRED_MASK                                              (0x3FFFU)
#define PWM_EPWM_DBRED_DBRED_SHIFT                                             (0x0000U)
#define PWM_EPWM_DBRED_DBRED_RESETVAL                                          (0x0000U)
#define PWM_EPWM_DBRED_DBRED_MAX                                               (0x3FFFU)

#define PWM_EPWM_DBRED_RESERVED_1_MASK                                         (0xC000U)
#define PWM_EPWM_DBRED_RESERVED_1_SHIFT                                        (0x000EU)
#define PWM_EPWM_DBRED_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_DBRED_RESERVED_1_MAX                                          (0x0003U)

