TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_DBRED_RESETVAL                                                (0x0000U)

/* DBFEDHR */

#define PWM_EPWM_DBFEDHR_RESERVED_1_MASK                                       (0x0001U)
#define PWM_EPWM_DBFEDHR_RESERVED_1_SHIFT                                      (0x0000U)
#define PWM_EPWM_DBFEDHR_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_DBFEDHR_RESERVED_1_MAX                                        (0x0001U)

#define PWM_EPWM_DBFEDHR_DBFEDHR_DELAY_MASK                                    (0x00FEU)
#define PWM_EPWM_DBFEDHR_DBFEDHR_DELAY_SHIFT                                   (0x0001U)
#define PWM_EPWM_DBFEDHR_DBFEDHR_DELAY_RESETVAL                                (0x0000U)
#define PWM_EPWM_DBFEDHR_DBFEDHR_DELAY_MAX                                     (0x007FU)

#define PWM_EPWM_DBFEDHR_RESERVED_2_MASK                                       (0x0100U)
#define PWM_EPWM_DBFEDHR_RESERVED_2_SHIFT                                      (0x0008U)
#define PWM_EPWM_DBFEDHR_RESERVED_2_RESETVAL                                   (0x0000U)
#define PWM_EPWM_DBFEDHR_RESERVED_2_MAX                                        (0x0001U)

#define PWM_EPWM_DBFEDHR_DBFEDHR_MASK                                          (0xFE00U)
#define PWM_EPWM_DBFEDHR_DBFEDHR_SHIFT                                         (0x0009U)
#define PWM_EPWM_DBFEDHR_DBFEDHR_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DBFEDHR_DBFEDHR_MAX                                           (0x007FU)

#define PWM_EPWM_DBFEDHR_RESETVAL                                              (0x0000U)

/* DBFED */

#define PWM_EPWM_DBFED_DBFED_MASK                                              (0x3FFFU)
#define PWM_EPWM_DBFED_DBFED_SHIFT                                             (0x0000U)
#define PWM_EPWM_DBFED_DBFED_RESETVAL                                          (0x0000U)
#define PWM_EPWM_DBFED_DBFED_MAX                                               (0x3FFFU)

#define PWM_EPWM_DBFED_RESERVED_1_MASK                                         (0xC000U)
#define PWM_EPWM_DBFED_RESERVED_1_SHIFT                                        (0x000EU)
#define PWM_EPWM_DBFED_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_DBFED_RESERVED_1_MAX                                          (0x0003U)

#define PWM_EPWM_DBFED_RESETVAL                                                (0x0000U)

/* RESERVED_20 */

#define PWM_EPWM_RESERVED_20_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_20_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_20_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_20_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_20_RESETVAL                                          (0x0000U)

/* TBPHS */

#define PWM_EPWM_TBPHS_TBPHSHR_MASK                                            (0x0000FFFFU)
#define PWM_EPWM_TBPHS_TBPHSHR_SHIFT                                           (0x00000000U)
#define PWM_EPWM_TBPHS_TBPHSHR_RESETVAL                                        (0x00000000U)
#define PWM_EPWM_TBPHS_TBPHSHR_MAX                                             (0x0000FFFFU)

#define PWM_EPWM_TBPHS_TBPHS_MASK                                              (0xFFFF0000U)
#define PWM_EPWM_TBPHS_TBPHS_SHIFT                                             (0x00000010U)
#define PWM_EPWM_TBPHS_TBPHS_RESETVAL                                          (0x00000000U)
#define PWM_EPWM_TBPHS_TBPHS_MAX                                               (0x0000FFFFU)

#define PWM_EPWM_TBPHS_RESETVAL                                                (0x00000000U)

/* TBPRDHR */

#define PWM_EPWM_TBPRDHR_TBPRDHR_MASK                                          (0xFFFFU)
#define PWM_EPWM_TBPRDHR_TBPRDHR_SHIFT                                         (0x0000U)
#define PWM_EPWM_TBPRDHR_TBPRDHR_RESETVAL                                      (0x0000U)
#define PWM_EPWM_TBPRDHR_TBPRDHR_MAX                                           (0xFFFFU)

#define PWM_EPWM_TBPRDHR_RESETVAL                                              (0x0000U)

/* TBPRD */

#define PWM_EPWM_TBPRD_TBPRD_MASK                                              (0xFFFFU)
#define PWM_EPWM_TBPRD_TBPRD_SHIFT                                             (0x0000U)
#define PWM_EPWM_TBPRD_TBPRD_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TBPRD_TBPRD_MAX                                               (0xFFFFU)

#define PWM_EPWM_TBPRD_RESETVAL                                                (0x0000U)

/* TBPRDHRB */

#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_MASK                                  (0x00FFU)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_SHIFT                                 (0x0000U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_RESETVAL                              (0x0000U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_DELAY_MAX                                   (0x00FFU)

#define PWM_EPWM_TBPRDHRB_TBPRDHRB_MASK                                        (0xFF00U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_SHIFT                                       (0x0008U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TBPRDHRB_TBPRDHRB_MAX                                         (0x00FFU)

#define PWM_EPWM_TBPRDHRB_RESETVAL                                             (0x0000U)

/* RESERVED_21 */

#define PWM_EPWM_RESERVED_21_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_21_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_21_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_21_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_21_RESETVAL                                          (0x0000U)

/* CMPA */

#define PWM_EPWM_CMPA_CMPAHR_MASK                                              (0x0000FFFFU)
#define PWM_EPWM_CMPA_CMPAHR_SHIFT                                             (0x00000000U)
#define PWM_EPWM_CMPA_CMPAHR_RESETVAL                                          (0x00000000U)
#define PWM_EPWM_CMPA_CMPAHR_MAX                                               (0x0000FFFFU)

#define PWM_EPWM_CMPA_CMPA_MASK                                                (0xFFFF0000U)
#define PWM_EPWM_CMPA_CMPA_SHIFT                                               (0x00000010U)
#define PWM_EPWM_CMPA_CMPA_RESETVAL                                            (0x00000000U)
#define PWM_EPWM_CMPA_CMPA_MAX                                                 (0x0000FFFFU)

#define PWM_EPWM_CMPA_RESETVAL                                                 (0x00000000U)

/* CMPB */

#define PWM_EPWM_CMPB_CMPBHR_MASK                                              (0x0000FFFFU)
#define PWM_EPWM_CMPB_CMPBHR_SHIFT                                             (0x00000000U)
#define PWM_EPWM_CMPB_CMPBHR_RESETVAL                                          (0x00000000U)
#define PWM_EPWM_CMPB_CMPBHR_MAX                                               (0x0000FFFFU)

#define PWM_EPWM_CMPB_CMPB_MASK                                                (0xFFFF0000U)
#define PWM_EPWM_CMPB_CMPB_SHIFT                                               (0x00000010U)
#define PWM_EPWM_CMPB_CMPB_RESETVAL                                            (0x00000000U)
#define PWM_EPWM_CMPB_CMPB_MAX                                                 (0x0000FFFFU)

#define PWM_EPWM_CMPB_RESETVAL                                                 (0x00000000U)

/* RESERVED_22 */

#define PWM_EPWM_RESERVED_22_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_22_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_22_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_22_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_22_RESETVAL                                          (0x0000U)

/* CMPC */

#define PWM_EPWM_CMPC_CMPC_MASK                                                (0xFFFFU)
#define PWM_EPWM_CMPC_CMPC_SHIFT                                               (0x0000U)
#define PWM_EPWM_CMPC_CMPC_RESETVAL                                            (0x0000U)
#define PWM_EPWM_CMPC_CMPC_MAX                                                 (0xFFFFU)

