TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_CMPC_RESETVAL                                                 (0x0000U)

/* RESERVED_23 */

#define PWM_EPWM_RESERVED_23_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_23_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_23_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_23_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_23_RESETVAL                                          (0x0000U)

/* CMPD */

#define PWM_EPWM_CMPD_CMPD_MASK                                                (0xFFFFU)
#define PWM_EPWM_CMPD_CMPD_SHIFT                                               (0x0000U)
#define PWM_EPWM_CMPD_CMPD_RESETVAL                                            (0x0000U)
#define PWM_EPWM_CMPD_CMPD_MAX                                                 (0xFFFFU)

#define PWM_EPWM_CMPD_RESETVAL                                                 (0x0000U)

/* RESERVED_24 */

#define PWM_EPWM_RESERVED_24_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_24_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_24_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_24_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_24_RESETVAL                                          (0x0000U)

/* GLDCTL2 */

#define PWM_EPWM_GLDCTL2_OSHTLD_MASK                                           (0x0001U)
#define PWM_EPWM_GLDCTL2_OSHTLD_SHIFT                                          (0x0000U)
#define PWM_EPWM_GLDCTL2_OSHTLD_RESETVAL                                       (0x0000U)
#define PWM_EPWM_GLDCTL2_OSHTLD_MAX                                            (0x0001U)

#define PWM_EPWM_GLDCTL2_GFRCLD_MASK                                           (0x0002U)
#define PWM_EPWM_GLDCTL2_GFRCLD_SHIFT                                          (0x0001U)
#define PWM_EPWM_GLDCTL2_GFRCLD_RESETVAL                                       (0x0000U)
#define PWM_EPWM_GLDCTL2_GFRCLD_MAX                                            (0x0001U)

#define PWM_EPWM_GLDCTL2_RESERVED_1_MASK                                       (0xFFFCU)
#define PWM_EPWM_GLDCTL2_RESERVED_1_SHIFT                                      (0x0002U)
#define PWM_EPWM_GLDCTL2_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_GLDCTL2_RESERVED_1_MAX                                        (0x3FFFU)

#define PWM_EPWM_GLDCTL2_RESETVAL                                              (0x0000U)

/* RESERVED_25 */

#define PWM_EPWM_RESERVED_25_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_25_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_25_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_25_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_25_RESETVAL                                          (0x0000U)

/* SWVDELVAL */

#define PWM_EPWM_SWVDELVAL_SWVDELVAL_MASK                                      (0xFFFFU)
#define PWM_EPWM_SWVDELVAL_SWVDELVAL_SHIFT                                     (0x0000U)
#define PWM_EPWM_SWVDELVAL_SWVDELVAL_RESETVAL                                  (0x0000U)
#define PWM_EPWM_SWVDELVAL_SWVDELVAL_MAX                                       (0xFFFFU)

#define PWM_EPWM_SWVDELVAL_RESETVAL                                            (0x0000U)

/* RESERVED_26 */

#define PWM_EPWM_RESERVED_26_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_26_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_26_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_26_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_26_RESETVAL                                          (0x0000U)

/* TZSEL */

#define PWM_EPWM_TZSEL_CBC1_MASK                                               (0x0001U)
#define PWM_EPWM_TZSEL_CBC1_SHIFT                                              (0x0000U)
#define PWM_EPWM_TZSEL_CBC1_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZSEL_CBC1_MAX                                                (0x0001U)

#define PWM_EPWM_TZSEL_CBC2_MASK                                               (0x0002U)
#define PWM_EPWM_TZSEL_CBC2_SHIFT                                              (0x0001U)
#define PWM_EPWM_TZSEL_CBC2_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZSEL_CBC2_MAX                                                (0x0001U)

#define PWM_EPWM_TZSEL_CBC3_MASK                                               (0x0004U)
#define PWM_EPWM_TZSEL_CBC3_SHIFT                                              (0x0002U)
#define PWM_EPWM_TZSEL_CBC3_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZSEL_CBC3_MAX                                                (0x0001U)

#define PWM_EPWM_TZSEL_CBC4_MASK                                               (0x0008U)
#define PWM_EPWM_TZSEL_CBC4_SHIFT                                              (0x0003U)
#define PWM_EPWM_TZSEL_CBC4_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZSEL_CBC4_MAX                                                (0x0001U)

#define PWM_EPWM_TZSEL_CBC5_MASK                                               (0x0010U)
#define PWM_EPWM_TZSEL_CBC5_SHIFT                                              (0x0004U)
#define PWM_EPWM_TZSEL_CBC5_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZSEL_CBC5_MAX                                                (0x0001U)

#define PWM_EPWM_TZSEL_CBC6_MASK                                               (0x0020U)
#define PWM_EPWM_TZSEL_CBC6_SHIFT                                              (0x0005U)
#define PWM_EPWM_TZSEL_CBC6_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZSEL_CBC6_MAX                                                (0x0001U)

#define PWM_EPWM_TZSEL_DCAEVT2_MASK                                            (0x0040U)
#define PWM_EPWM_TZSEL_DCAEVT2_SHIFT                                           (0x0006U)
#define PWM_EPWM_TZSEL_DCAEVT2_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZSEL_DCAEVT2_MAX                                             (0x0001U)

#define PWM_EPWM_TZSEL_DCBEVT2_MASK                                            (0x0080U)
#define PWM_EPWM_TZSEL_DCBEVT2_SHIFT                                           (0x0007U)
#define PWM_EPWM_TZSEL_DCBEVT2_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZSEL_DCBEVT2_MAX                                             (0x0001U)

#define PWM_EPWM_TZSEL_OSHT1_MASK                                              (0x0100U)
#define PWM_EPWM_TZSEL_OSHT1_SHIFT                                             (0x0008U)
#define PWM_EPWM_TZSEL_OSHT1_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TZSEL_OSHT1_MAX                                               (0x0001U)

