TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_TZCTL_DCBEVT1_MASK                                            (0x0300U)
#define PWM_EPWM_TZCTL_DCBEVT1_SHIFT                                           (0x0008U)
#define PWM_EPWM_TZCTL_DCBEVT1_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZCTL_DCBEVT1_MAX                                             (0x0003U)

#define PWM_EPWM_TZCTL_DCBEVT2_MASK                                            (0x0C00U)
#define PWM_EPWM_TZCTL_DCBEVT2_SHIFT                                           (0x000AU)
#define PWM_EPWM_TZCTL_DCBEVT2_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZCTL_DCBEVT2_MAX                                             (0x0003U)

#define PWM_EPWM_TZCTL_RESERVED_1_MASK                                         (0xF000U)
#define PWM_EPWM_TZCTL_RESERVED_1_SHIFT                                        (0x000CU)
#define PWM_EPWM_TZCTL_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_TZCTL_RESERVED_1_MAX                                          (0x000FU)

#define PWM_EPWM_TZCTL_RESETVAL                                                (0x0000U)

/* TZCTL2 */

#define PWM_EPWM_TZCTL2_TZAU_MASK                                              (0x0007U)
#define PWM_EPWM_TZCTL2_TZAU_SHIFT                                             (0x0000U)
#define PWM_EPWM_TZCTL2_TZAU_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TZCTL2_TZAU_MAX                                               (0x0007U)

#define PWM_EPWM_TZCTL2_TZAD_MASK                                              (0x0038U)
#define PWM_EPWM_TZCTL2_TZAD_SHIFT                                             (0x0003U)
#define PWM_EPWM_TZCTL2_TZAD_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TZCTL2_TZAD_MAX                                               (0x0007U)

#define PWM_EPWM_TZCTL2_TZBU_MASK                                              (0x01C0U)
#define PWM_EPWM_TZCTL2_TZBU_SHIFT                                             (0x0006U)
#define PWM_EPWM_TZCTL2_TZBU_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TZCTL2_TZBU_MAX                                               (0x0007U)

#define PWM_EPWM_TZCTL2_TZBD_MASK                                              (0x0E00U)
#define PWM_EPWM_TZCTL2_TZBD_SHIFT                                             (0x0009U)
#define PWM_EPWM_TZCTL2_TZBD_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TZCTL2_TZBD_MAX                                               (0x0007U)

#define PWM_EPWM_TZCTL2_RESERVED_1_MASK                                        (0x7000U)
#define PWM_EPWM_TZCTL2_RESERVED_1_SHIFT                                       (0x000CU)
#define PWM_EPWM_TZCTL2_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTL2_RESERVED_1_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTL2_ETZE_MASK                                              (0x8000U)
#define PWM_EPWM_TZCTL2_ETZE_SHIFT                                             (0x000FU)
#define PWM_EPWM_TZCTL2_ETZE_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TZCTL2_ETZE_MAX                                               (0x0001U)

#define PWM_EPWM_TZCTL2_RESETVAL                                               (0x0000U)

/* TZCTLDCA */

#define PWM_EPWM_TZCTLDCA_DCAEVT1U_MASK                                        (0x0007U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1U_SHIFT                                       (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1U_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1U_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCA_DCAEVT1D_MASK                                        (0x0038U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1D_SHIFT                                       (0x0003U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1D_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT1D_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCA_DCAEVT2U_MASK                                        (0x01C0U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2U_SHIFT                                       (0x0006U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2U_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2U_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCA_DCAEVT2D_MASK                                        (0x0E00U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2D_SHIFT                                       (0x0009U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2D_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCA_DCAEVT2D_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCA_RESERVED_1_MASK                                      (0xF000U)
#define PWM_EPWM_TZCTLDCA_RESERVED_1_SHIFT                                     (0x000CU)
#define PWM_EPWM_TZCTLDCA_RESERVED_1_RESETVAL                                  (0x0000U)
#define PWM_EPWM_TZCTLDCA_RESERVED_1_MAX                                       (0x000FU)

#define PWM_EPWM_TZCTLDCA_RESETVAL                                             (0x0000U)

/* TZCTLDCB */

#define PWM_EPWM_TZCTLDCB_DCBEVT1U_MASK                                        (0x0007U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1U_SHIFT                                       (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1U_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1U_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCB_DCBEVT1D_MASK                                        (0x0038U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1D_SHIFT                                       (0x0003U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1D_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT1D_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCB_DCBEVT2U_MASK                                        (0x01C0U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2U_SHIFT                                       (0x0006U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2U_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2U_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCB_DCBEVT2D_MASK                                        (0x0E00U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2D_SHIFT                                       (0x0009U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2D_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZCTLDCB_DCBEVT2D_MAX                                         (0x0007U)

#define PWM_EPWM_TZCTLDCB_RESERVED_1_MASK                                      (0xF000U)
#define PWM_EPWM_TZCTLDCB_RESERVED_1_SHIFT                                     (0x000CU)
#define PWM_EPWM_TZCTLDCB_RESERVED_1_RESETVAL                                  (0x0000U)
#define PWM_EPWM_TZCTLDCB_RESERVED_1_MAX                                       (0x000FU)

#define PWM_EPWM_TZCTLDCB_RESETVAL                                             (0x0000U)

/* RESERVED_28 */

#define PWM_EPWM_RESERVED_28_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_28_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_28_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_28_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_28_RESETVAL                                          (0x0000U)

/* TZEINT */

