TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_ETCNTINITCTL_RESERVED_1_MASK                                  (0x03FFU)
#define PWM_EPWM_ETCNTINITCTL_RESERVED_1_SHIFT                                 (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_RESERVED_1_RESETVAL                              (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_RESERVED_1_MAX                                   (0x03FFU)

#define PWM_EPWM_ETCNTINITCTL_INTINITFRC_MASK                                  (0x0400U)
#define PWM_EPWM_ETCNTINITCTL_INTINITFRC_SHIFT                                 (0x000AU)
#define PWM_EPWM_ETCNTINITCTL_INTINITFRC_RESETVAL                              (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_INTINITFRC_MAX                                   (0x0001U)

#define PWM_EPWM_ETCNTINITCTL_SOCAINITFRC_MASK                                 (0x0800U)
#define PWM_EPWM_ETCNTINITCTL_SOCAINITFRC_SHIFT                                (0x000BU)
#define PWM_EPWM_ETCNTINITCTL_SOCAINITFRC_RESETVAL                             (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_SOCAINITFRC_MAX                                  (0x0001U)

#define PWM_EPWM_ETCNTINITCTL_SOCBINITFRC_MASK                                 (0x1000U)
#define PWM_EPWM_ETCNTINITCTL_SOCBINITFRC_SHIFT                                (0x000CU)
#define PWM_EPWM_ETCNTINITCTL_SOCBINITFRC_RESETVAL                             (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_SOCBINITFRC_MAX                                  (0x0001U)

#define PWM_EPWM_ETCNTINITCTL_INTINITEN_MASK                                   (0x2000U)
#define PWM_EPWM_ETCNTINITCTL_INTINITEN_SHIFT                                  (0x000DU)
#define PWM_EPWM_ETCNTINITCTL_INTINITEN_RESETVAL                               (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_INTINITEN_MAX                                    (0x0001U)

#define PWM_EPWM_ETCNTINITCTL_SOCAINITEN_MASK                                  (0x4000U)
#define PWM_EPWM_ETCNTINITCTL_SOCAINITEN_SHIFT                                 (0x000EU)
#define PWM_EPWM_ETCNTINITCTL_SOCAINITEN_RESETVAL                              (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_SOCAINITEN_MAX                                   (0x0001U)

#define PWM_EPWM_ETCNTINITCTL_SOCBINITEN_MASK                                  (0x8000U)
#define PWM_EPWM_ETCNTINITCTL_SOCBINITEN_SHIFT                                 (0x000FU)
#define PWM_EPWM_ETCNTINITCTL_SOCBINITEN_RESETVAL                              (0x0000U)
#define PWM_EPWM_ETCNTINITCTL_SOCBINITEN_MAX                                   (0x0001U)

#define PWM_EPWM_ETCNTINITCTL_RESETVAL                                         (0x0000U)

/* RESERVED_41 */

#define PWM_EPWM_RESERVED_41_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_41_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_41_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_41_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_41_RESETVAL                                          (0x0000U)

/* ETCNTINIT */

#define PWM_EPWM_ETCNTINIT_INTINIT_MASK                                        (0x000FU)
#define PWM_EPWM_ETCNTINIT_INTINIT_SHIFT                                       (0x0000U)
#define PWM_EPWM_ETCNTINIT_INTINIT_RESETVAL                                    (0x0000U)
#define PWM_EPWM_ETCNTINIT_INTINIT_MAX                                         (0x000FU)

#define PWM_EPWM_ETCNTINIT_SOCAINIT_MASK                                       (0x00F0U)
#define PWM_EPWM_ETCNTINIT_SOCAINIT_SHIFT                                      (0x0004U)
#define PWM_EPWM_ETCNTINIT_SOCAINIT_RESETVAL                                   (0x0000U)
#define PWM_EPWM_ETCNTINIT_SOCAINIT_MAX                                        (0x000FU)

#define PWM_EPWM_ETCNTINIT_SOCBINIT_MASK                                       (0x0F00U)
#define PWM_EPWM_ETCNTINIT_SOCBINIT_SHIFT                                      (0x0008U)
#define PWM_EPWM_ETCNTINIT_SOCBINIT_RESETVAL                                   (0x0000U)
#define PWM_EPWM_ETCNTINIT_SOCBINIT_MAX                                        (0x000FU)

#define PWM_EPWM_ETCNTINIT_RESERVED_1_MASK                                     (0xF000U)
#define PWM_EPWM_ETCNTINIT_RESERVED_1_SHIFT                                    (0x000CU)
#define PWM_EPWM_ETCNTINIT_RESERVED_1_RESETVAL                                 (0x0000U)
#define PWM_EPWM_ETCNTINIT_RESERVED_1_MAX                                      (0x000FU)

#define PWM_EPWM_ETCNTINIT_RESETVAL                                            (0x0000U)

/* RESERVED_42 */

#define PWM_EPWM_RESERVED_42_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_42_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_42_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_42_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_42_RESETVAL                                          (0x0000U)

/* ETINTMIXEN */

#define PWM_EPWM_ETINTMIXEN_ZRO_MASK                                           (0x0001U)
#define PWM_EPWM_ETINTMIXEN_ZRO_SHIFT                                          (0x0000U)
#define PWM_EPWM_ETINTMIXEN_ZRO_RESETVAL                                       (0x0001U)
#define PWM_EPWM_ETINTMIXEN_ZRO_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_PRD_MASK                                           (0x0002U)
#define PWM_EPWM_ETINTMIXEN_PRD_SHIFT                                          (0x0001U)
#define PWM_EPWM_ETINTMIXEN_PRD_RESETVAL                                       (0x0001U)
#define PWM_EPWM_ETINTMIXEN_PRD_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_CAU_MASK                                           (0x0004U)
#define PWM_EPWM_ETINTMIXEN_CAU_SHIFT                                          (0x0002U)
#define PWM_EPWM_ETINTMIXEN_CAU_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CAU_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_CAD_MASK                                           (0x0008U)
#define PWM_EPWM_ETINTMIXEN_CAD_SHIFT                                          (0x0003U)
#define PWM_EPWM_ETINTMIXEN_CAD_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CAD_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_CBU_MASK                                           (0x0010U)
#define PWM_EPWM_ETINTMIXEN_CBU_SHIFT                                          (0x0004U)
#define PWM_EPWM_ETINTMIXEN_CBU_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CBU_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_CBD_MASK                                           (0x0020U)
#define PWM_EPWM_ETINTMIXEN_CBD_SHIFT                                          (0x0005U)
#define PWM_EPWM_ETINTMIXEN_CBD_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CBD_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_CCU_MASK                                           (0x0040U)
#define PWM_EPWM_ETINTMIXEN_CCU_SHIFT                                          (0x0006U)
#define PWM_EPWM_ETINTMIXEN_CCU_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CCU_MAX                                            (0x0001U)

