TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_ETINTMIXEN_CCD_MASK                                           (0x0080U)
#define PWM_EPWM_ETINTMIXEN_CCD_SHIFT                                          (0x0007U)
#define PWM_EPWM_ETINTMIXEN_CCD_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CCD_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_CDU_MASK                                           (0x0100U)
#define PWM_EPWM_ETINTMIXEN_CDU_SHIFT                                          (0x0008U)
#define PWM_EPWM_ETINTMIXEN_CDU_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CDU_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_CDD_MASK                                           (0x0200U)
#define PWM_EPWM_ETINTMIXEN_CDD_SHIFT                                          (0x0009U)
#define PWM_EPWM_ETINTMIXEN_CDD_RESETVAL                                       (0x0000U)
#define PWM_EPWM_ETINTMIXEN_CDD_MAX                                            (0x0001U)

#define PWM_EPWM_ETINTMIXEN_DCAEVT1_MASK                                       (0x0400U)
#define PWM_EPWM_ETINTMIXEN_DCAEVT1_SHIFT                                      (0x000AU)
#define PWM_EPWM_ETINTMIXEN_DCAEVT1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_ETINTMIXEN_DCAEVT1_MAX                                        (0x0001U)

#define PWM_EPWM_ETINTMIXEN_RESERVED_1_MASK                                    (0xF800U)
#define PWM_EPWM_ETINTMIXEN_RESERVED_1_SHIFT                                   (0x000BU)
#define PWM_EPWM_ETINTMIXEN_RESERVED_1_RESETVAL                                (0x0000U)
#define PWM_EPWM_ETINTMIXEN_RESERVED_1_MAX                                     (0x001FU)

#define PWM_EPWM_ETINTMIXEN_RESETVAL                                           (0x0003U)

/* RESERVED_43 */

#define PWM_EPWM_RESERVED_43_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_43_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_43_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_43_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_43_RESETVAL                                          (0x0000U)

/* ETSOCAMIXEN */

#define PWM_EPWM_ETSOCAMIXEN_ZRO_MASK                                          (0x0001U)
#define PWM_EPWM_ETSOCAMIXEN_ZRO_SHIFT                                         (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_ZRO_RESETVAL                                      (0x0001U)
#define PWM_EPWM_ETSOCAMIXEN_ZRO_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_PRD_MASK                                          (0x0002U)
#define PWM_EPWM_ETSOCAMIXEN_PRD_SHIFT                                         (0x0001U)
#define PWM_EPWM_ETSOCAMIXEN_PRD_RESETVAL                                      (0x0001U)
#define PWM_EPWM_ETSOCAMIXEN_PRD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CAU_MASK                                          (0x0004U)
#define PWM_EPWM_ETSOCAMIXEN_CAU_SHIFT                                         (0x0002U)
#define PWM_EPWM_ETSOCAMIXEN_CAU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CAU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CAD_MASK                                          (0x0008U)
#define PWM_EPWM_ETSOCAMIXEN_CAD_SHIFT                                         (0x0003U)
#define PWM_EPWM_ETSOCAMIXEN_CAD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CAD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CBU_MASK                                          (0x0010U)
#define PWM_EPWM_ETSOCAMIXEN_CBU_SHIFT                                         (0x0004U)
#define PWM_EPWM_ETSOCAMIXEN_CBU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CBU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CBD_MASK                                          (0x0020U)
#define PWM_EPWM_ETSOCAMIXEN_CBD_SHIFT                                         (0x0005U)
#define PWM_EPWM_ETSOCAMIXEN_CBD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CBD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CCU_MASK                                          (0x0040U)
#define PWM_EPWM_ETSOCAMIXEN_CCU_SHIFT                                         (0x0006U)
#define PWM_EPWM_ETSOCAMIXEN_CCU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CCU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CCD_MASK                                          (0x0080U)
#define PWM_EPWM_ETSOCAMIXEN_CCD_SHIFT                                         (0x0007U)
#define PWM_EPWM_ETSOCAMIXEN_CCD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CCD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CDU_MASK                                          (0x0100U)
#define PWM_EPWM_ETSOCAMIXEN_CDU_SHIFT                                         (0x0008U)
#define PWM_EPWM_ETSOCAMIXEN_CDU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CDU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_CDD_MASK                                          (0x0200U)
#define PWM_EPWM_ETSOCAMIXEN_CDD_SHIFT                                         (0x0009U)
#define PWM_EPWM_ETSOCAMIXEN_CDD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_CDD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCAMIXEN_DCAEVT1_MASK                                      (0x0400U)
#define PWM_EPWM_ETSOCAMIXEN_DCAEVT1_SHIFT                                     (0x000AU)
#define PWM_EPWM_ETSOCAMIXEN_DCAEVT1_RESETVAL                                  (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_DCAEVT1_MAX                                       (0x0001U)

