TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_MASK                                     (0xC000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_SHIFT                                    (0x000EU)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_RESETVAL                                 (0x0000U)
#define PWM_EPWM_XAQCTLB_ACTIVE_XCMP8_MAX                                      (0x0003U)

#define PWM_EPWM_XAQCTLB_ACTIVE_RESETVAL                                       (0x0000U)

/* RESERVED_60 */

#define PWM_EPWM_RESERVED_60_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_60_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_60_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_60_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_60_RESETVAL                                          (0x00000000U)

/* XMINMAX_ACTIVE */

#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_MASK                               (0x0000FFFFU)
#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_SHIFT                              (0x00000000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_RESETVAL                           (0x00000000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_MAX                                (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_MASK                               (0xFFFF0000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_SHIFT                              (0x00000010U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_RESETVAL                           (0x00000000U)
#define PWM_EPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_MAX                                (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_ACTIVE_RESETVAL                                       (0x00000000U)

/* RESERVED_61 */

#define PWM_EPWM_RESERVED_61_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_61_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_61_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_61_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_61_RESETVAL                                          (0x00000000U)

/* XCMP1_SHDW1 */

#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW1_XCMP1_SHDW1_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW1_RESETVAL                                          (0x00000000U)

/* XCMP2_SHDW1 */

#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW1_XCMP2_SHDW1_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW1_RESETVAL                                          (0x00000000U)

/* XCMP3_SHDW1 */

#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW1_XCMP3_SHDW1_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW1_RESETVAL                                          (0x00000000U)

/* XCMP4_SHDW1 */

#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW1_XCMP4_SHDW1_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW1_RESETVAL                                          (0x00000000U)

/* XCMP5_SHDW1 */

#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_MAX                                 (0x0000FFFFU)

