TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP5_MASK                                      (0x0300U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP5_SHIFT                                     (0x0008U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP5_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP5_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW1_XCMP6_MASK                                      (0x0C00U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP6_SHIFT                                     (0x000AU)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP6_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP6_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW1_XCMP7_MASK                                      (0x3000U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP7_SHIFT                                     (0x000CU)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP7_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP7_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW1_XCMP8_MASK                                      (0xC000U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP8_SHIFT                                     (0x000EU)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP8_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW1_XCMP8_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW1_RESETVAL                                        (0x0000U)

/* RESERVED_63 */

#define PWM_EPWM_RESERVED_63_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_63_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_63_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_63_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_63_RESETVAL                                          (0x0000U)

/* CMPC_SHDW1 */

#define PWM_EPWM_CMPC_SHDW1_CMPC_SHDW1_MASK                                    (0xFFFFU)
#define PWM_EPWM_CMPC_SHDW1_CMPC_SHDW1_SHIFT                                   (0x0000U)
#define PWM_EPWM_CMPC_SHDW1_CMPC_SHDW1_RESETVAL                                (0x0000U)
#define PWM_EPWM_CMPC_SHDW1_CMPC_SHDW1_MAX                                     (0xFFFFU)

#define PWM_EPWM_CMPC_SHDW1_RESETVAL                                           (0x0000U)

/* RESERVED_64 */

#define PWM_EPWM_RESERVED_64_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_64_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_64_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_64_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_64_RESETVAL                                          (0x0000U)

/* CMPD_SHDW1 */

#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_MASK                                    (0xFFFFU)
#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_SHIFT                                   (0x0000U)
#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_RESETVAL                                (0x0000U)
#define PWM_EPWM_CMPD_SHDW1_CMPD_SHDW1_MAX                                     (0xFFFFU)

#define PWM_EPWM_CMPD_SHDW1_RESETVAL                                           (0x0000U)

/* RESERVED_65 */

#define PWM_EPWM_RESERVED_65_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_65_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_65_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_65_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_65_RESETVAL                                          (0x00000000U)

/* XMINMAX_SHDW1 */

#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_MASK                                 (0x0000FFFFU)
#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_SHIFT                                (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_RESETVAL                             (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMAX_SHDW1_MAX                                  (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_MASK                                 (0xFFFF0000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_SHIFT                                (0x00000010U)
#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_RESETVAL                             (0x00000000U)
#define PWM_EPWM_XMINMAX_SHDW1_XMIN_SHDW1_MAX                                  (0x0000FFFFU)

#define PWM_EPWM_XMINMAX_SHDW1_RESETVAL                                        (0x00000000U)

/* RESERVED_66 */

#define PWM_EPWM_RESERVED_66_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_66_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_66_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_66_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_66_RESETVAL                                          (0x00000000U)

/* XCMP1_SHDW2 */

#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW2_XCMP1_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW2_RESETVAL                                          (0x00000000U)

/* XCMP2_SHDW2 */

