TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_XCMP7_SHDW3_XCMP7_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP7_SHDW3_XCMP7_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP7_SHDW3_XCMP7_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW3_XCMP7_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP7_SHDW3_RESETVAL                                          (0x00000000U)

/* XCMP8_SHDW3 */

#define PWM_EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP8_SHDW3_XCMP8_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP8_SHDW3_XCMP8_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP8_SHDW3_XCMP8_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW3_XCMP8_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP8_SHDW3_RESETVAL                                          (0x00000000U)

/* XTBPRD_SHDW3 */

#define PWM_EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_MASK                              (0x0000FFFFU)
#define PWM_EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_SHIFT                             (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_MAX                               (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_MASK                                (0xFFFF0000U)
#define PWM_EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_SHIFT                               (0x00000010U)
#define PWM_EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_SHDW3_RESETVAL                                         (0x00000000U)

/* RESERVED_72 */

#define PWM_EPWM_RESERVED_72_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_72_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_72_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_72_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_72_RESETVAL                                          (0x00000000U)

/* XAQCTLA_SHDW3 */

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP1_MASK                                      (0x0003U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP1_SHIFT                                     (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP1_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP1_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP2_MASK                                      (0x000CU)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP2_SHIFT                                     (0x0002U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP2_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP2_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP3_MASK                                      (0x0030U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP3_SHIFT                                     (0x0004U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP3_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP3_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP4_MASK                                      (0x00C0U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP4_SHIFT                                     (0x0006U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP4_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP4_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP5_MASK                                      (0x0300U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP5_SHIFT                                     (0x0008U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP5_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP5_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP6_MASK                                      (0x0C00U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP6_SHIFT                                     (0x000AU)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP6_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP6_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP7_MASK                                      (0x3000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP7_SHIFT                                     (0x000CU)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP7_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP7_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_XCMP8_MASK                                      (0xC000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP8_SHIFT                                     (0x000EU)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP8_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLA_SHDW3_XCMP8_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLA_SHDW3_RESETVAL                                        (0x0000U)

/* XAQCTLB_SHDW3 */

#define PWM_EPWM_XAQCTLB_SHDW3_RESERVED_1_MASK                                 (0x00FFU)
#define PWM_EPWM_XAQCTLB_SHDW3_RESERVED_1_SHIFT                                (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_RESERVED_1_RESETVAL                             (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_RESERVED_1_MAX                                  (0x00FFU)

#define PWM_EPWM_XAQCTLB_SHDW3_XCMP5_MASK                                      (0x0300U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP5_SHIFT                                     (0x0008U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP5_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP5_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW3_XCMP6_MASK                                      (0x0C00U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP6_SHIFT                                     (0x000AU)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP6_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP6_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_MASK                                      (0x3000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_SHIFT                                     (0x000CU)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP7_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_MASK                                      (0xC000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_SHIFT                                     (0x000EU)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_RESETVAL                                  (0x0000U)
#define PWM_EPWM_XAQCTLB_SHDW3_XCMP8_MAX                                       (0x0003U)

#define PWM_EPWM_XAQCTLB_SHDW3_RESETVAL                                        (0x0000U)

