TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_DECOMPSEL_RESERVED_2_MASK                                     (0xFFC00000U)
#define PWM_EPWM_DECOMPSEL_RESERVED_2_SHIFT                                    (0x00000016U)
#define PWM_EPWM_DECOMPSEL_RESERVED_2_RESETVAL                                 (0x00000000U)
#define PWM_EPWM_DECOMPSEL_RESERVED_2_MAX                                      (0x000003FFU)

#define PWM_EPWM_DECOMPSEL_RESETVAL                                            (0x00000000U)

/* DEACTCTL */

#define PWM_EPWM_DEACTCTL_PWMA_MASK                                            (0x00000003U)
#define PWM_EPWM_DEACTCTL_PWMA_SHIFT                                           (0x00000000U)
#define PWM_EPWM_DEACTCTL_PWMA_RESETVAL                                        (0x00000000U)
#define PWM_EPWM_DEACTCTL_PWMA_MAX                                             (0x00000003U)

#define PWM_EPWM_DEACTCTL_TRIPSELA_MASK                                        (0x00000004U)
#define PWM_EPWM_DEACTCTL_TRIPSELA_SHIFT                                       (0x00000002U)
#define PWM_EPWM_DEACTCTL_TRIPSELA_RESETVAL                                    (0x00000000U)
#define PWM_EPWM_DEACTCTL_TRIPSELA_MAX                                         (0x00000001U)

#define PWM_EPWM_DEACTCTL_RESERVED_1_MASK                                      (0x00000008U)
#define PWM_EPWM_DEACTCTL_RESERVED_1_SHIFT                                     (0x00000003U)
#define PWM_EPWM_DEACTCTL_RESERVED_1_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_DEACTCTL_RESERVED_1_MAX                                       (0x00000001U)

#define PWM_EPWM_DEACTCTL_PWMB_MASK                                            (0x00000030U)
#define PWM_EPWM_DEACTCTL_PWMB_SHIFT                                           (0x00000004U)
#define PWM_EPWM_DEACTCTL_PWMB_RESETVAL                                        (0x00000000U)
#define PWM_EPWM_DEACTCTL_PWMB_MAX                                             (0x00000003U)

#define PWM_EPWM_DEACTCTL_TRIPSELB_MASK                                        (0x00000040U)
#define PWM_EPWM_DEACTCTL_TRIPSELB_SHIFT                                       (0x00000006U)
#define PWM_EPWM_DEACTCTL_TRIPSELB_RESETVAL                                    (0x00000000U)
#define PWM_EPWM_DEACTCTL_TRIPSELB_MAX                                         (0x00000001U)

#define PWM_EPWM_DEACTCTL_RESERVED_2_MASK                                      (0x0000FF80U)
#define PWM_EPWM_DEACTCTL_RESERVED_2_SHIFT                                     (0x00000007U)
#define PWM_EPWM_DEACTCTL_RESERVED_2_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_DEACTCTL_RESERVED_2_MAX                                       (0x000001FFU)

#define PWM_EPWM_DEACTCTL_TRIPENABLE_MASK                                      (0x00010000U)
#define PWM_EPWM_DEACTCTL_TRIPENABLE_SHIFT                                     (0x00000010U)
#define PWM_EPWM_DEACTCTL_TRIPENABLE_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_DEACTCTL_TRIPENABLE_MAX                                       (0x00000001U)

#define PWM_EPWM_DEACTCTL_RESERVED_3_MASK                                      (0xFFFE0000U)
#define PWM_EPWM_DEACTCTL_RESERVED_3_SHIFT                                     (0x00000011U)
#define PWM_EPWM_DEACTCTL_RESERVED_3_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_DEACTCTL_RESERVED_3_MAX                                       (0x00007FFFU)

#define PWM_EPWM_DEACTCTL_RESETVAL                                             (0x00000000U)

/* DESTS */

#define PWM_EPWM_DESTS_DEACTIVE_MASK                                           (0x00000001U)
#define PWM_EPWM_DESTS_DEACTIVE_SHIFT                                          (0x00000000U)
#define PWM_EPWM_DESTS_DEACTIVE_RESETVAL                                       (0x00000000U)
#define PWM_EPWM_DESTS_DEACTIVE_MAX                                            (0x00000001U)

#define PWM_EPWM_DESTS_RESERVED_1_MASK                                         (0xFFFFFFFEU)
#define PWM_EPWM_DESTS_RESERVED_1_SHIFT                                        (0x00000001U)
#define PWM_EPWM_DESTS_RESERVED_1_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_DESTS_RESERVED_1_MAX                                          (0x7FFFFFFFU)

#define PWM_EPWM_DESTS_RESETVAL                                                (0x00000000U)

/* DEFRC */

#define PWM_EPWM_DEFRC_DEACTIVE_MASK                                           (0x00000001U)
#define PWM_EPWM_DEFRC_DEACTIVE_SHIFT                                          (0x00000000U)
#define PWM_EPWM_DEFRC_DEACTIVE_RESETVAL                                       (0x00000000U)
#define PWM_EPWM_DEFRC_DEACTIVE_MAX                                            (0x00000001U)

#define PWM_EPWM_DEFRC_RESERVED_1_MASK                                         (0xFFFFFFFEU)
#define PWM_EPWM_DEFRC_RESERVED_1_SHIFT                                        (0x00000001U)
#define PWM_EPWM_DEFRC_RESERVED_1_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_DEFRC_RESERVED_1_MAX                                          (0x7FFFFFFFU)

#define PWM_EPWM_DEFRC_RESETVAL                                                (0x00000000U)

/* DECLR */

#define PWM_EPWM_DECLR_DEACTIVE_MASK                                           (0x00000001U)
#define PWM_EPWM_DECLR_DEACTIVE_SHIFT                                          (0x00000000U)
#define PWM_EPWM_DECLR_DEACTIVE_RESETVAL                                       (0x00000000U)
#define PWM_EPWM_DECLR_DEACTIVE_MAX                                            (0x00000001U)

#define PWM_EPWM_DECLR_RESERVED_1_MASK                                         (0xFFFFFFFEU)
#define PWM_EPWM_DECLR_RESERVED_1_SHIFT                                        (0x00000001U)
#define PWM_EPWM_DECLR_RESERVED_1_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_DECLR_RESERVED_1_MAX                                          (0x7FFFFFFFU)

#define PWM_EPWM_DECLR_RESETVAL                                                (0x00000000U)

/* RESERVED_77 */

#define PWM_EPWM_RESERVED_77_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_77_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_77_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_77_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_77_RESETVAL                                          (0x00000000U)

