TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_LUTCTLA_LUTDEC1_MASK                                          (0x00020000U)
#define PWM_EPWM_LUTCTLA_LUTDEC1_SHIFT                                         (0x00000011U)
#define PWM_EPWM_LUTCTLA_LUTDEC1_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC1_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLA_LUTDEC2_MASK                                          (0x00040000U)
#define PWM_EPWM_LUTCTLA_LUTDEC2_SHIFT                                         (0x00000012U)
#define PWM_EPWM_LUTCTLA_LUTDEC2_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC2_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLA_LUTDEC3_MASK                                          (0x00080000U)
#define PWM_EPWM_LUTCTLA_LUTDEC3_SHIFT                                         (0x00000013U)
#define PWM_EPWM_LUTCTLA_LUTDEC3_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC3_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLA_LUTDEC4_MASK                                          (0x00100000U)
#define PWM_EPWM_LUTCTLA_LUTDEC4_SHIFT                                         (0x00000014U)
#define PWM_EPWM_LUTCTLA_LUTDEC4_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC4_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLA_LUTDEC5_MASK                                          (0x00200000U)
#define PWM_EPWM_LUTCTLA_LUTDEC5_SHIFT                                         (0x00000015U)
#define PWM_EPWM_LUTCTLA_LUTDEC5_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC5_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLA_LUTDEC6_MASK                                          (0x00400000U)
#define PWM_EPWM_LUTCTLA_LUTDEC6_SHIFT                                         (0x00000016U)
#define PWM_EPWM_LUTCTLA_LUTDEC6_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC6_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLA_LUTDEC7_MASK                                          (0x00800000U)
#define PWM_EPWM_LUTCTLA_LUTDEC7_SHIFT                                         (0x00000017U)
#define PWM_EPWM_LUTCTLA_LUTDEC7_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC7_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLA_RESERVED_3_MASK                                       (0xFF000000U)
#define PWM_EPWM_LUTCTLA_RESERVED_3_SHIFT                                      (0x00000018U)
#define PWM_EPWM_LUTCTLA_RESERVED_3_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_LUTCTLA_RESERVED_3_MAX                                        (0x000000FFU)

#define PWM_EPWM_LUTCTLA_RESETVAL                                              (0x00000001U)

/* LUTCTLB */

#define PWM_EPWM_LUTCTLB_BYPASS_MASK                                           (0x00000001U)
#define PWM_EPWM_LUTCTLB_BYPASS_SHIFT                                          (0x00000000U)
#define PWM_EPWM_LUTCTLB_BYPASS_RESETVAL                                       (0x00000001U)
#define PWM_EPWM_LUTCTLB_BYPASS_MAX                                            (0x00000001U)

#define PWM_EPWM_LUTCTLB_RESERVED_1_MASK                                       (0x0000000EU)
#define PWM_EPWM_LUTCTLB_RESERVED_1_SHIFT                                      (0x00000001U)
#define PWM_EPWM_LUTCTLB_RESERVED_1_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_LUTCTLB_RESERVED_1_MAX                                        (0x00000007U)

#define PWM_EPWM_LUTCTLB_SELXBAR_MASK                                          (0x000000F0U)
#define PWM_EPWM_LUTCTLB_SELXBAR_SHIFT                                         (0x00000004U)
#define PWM_EPWM_LUTCTLB_SELXBAR_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_SELXBAR_MAX                                           (0x0000000FU)

#define PWM_EPWM_LUTCTLB_RESERVED_2_MASK                                       (0x0000FF00U)
#define PWM_EPWM_LUTCTLB_RESERVED_2_SHIFT                                      (0x00000008U)
#define PWM_EPWM_LUTCTLB_RESERVED_2_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_LUTCTLB_RESERVED_2_MAX                                        (0x000000FFU)

#define PWM_EPWM_LUTCTLB_LUTDEC0_MASK                                          (0x00010000U)
#define PWM_EPWM_LUTCTLB_LUTDEC0_SHIFT                                         (0x00000010U)
#define PWM_EPWM_LUTCTLB_LUTDEC0_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC0_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC1_MASK                                          (0x00020000U)
#define PWM_EPWM_LUTCTLB_LUTDEC1_SHIFT                                         (0x00000011U)
#define PWM_EPWM_LUTCTLB_LUTDEC1_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC1_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC2_MASK                                          (0x00040000U)
#define PWM_EPWM_LUTCTLB_LUTDEC2_SHIFT                                         (0x00000012U)
#define PWM_EPWM_LUTCTLB_LUTDEC2_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC2_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC3_MASK                                          (0x00080000U)
#define PWM_EPWM_LUTCTLB_LUTDEC3_SHIFT                                         (0x00000013U)
#define PWM_EPWM_LUTCTLB_LUTDEC3_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC3_MAX                                           (0x00000001U)

