TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_EPWM_LUTCTLB_LUTDEC4_MASK                                          (0x00100000U)
#define PWM_EPWM_LUTCTLB_LUTDEC4_SHIFT                                         (0x00000014U)
#define PWM_EPWM_LUTCTLB_LUTDEC4_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC4_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC5_MASK                                          (0x00200000U)
#define PWM_EPWM_LUTCTLB_LUTDEC5_SHIFT                                         (0x00000015U)
#define PWM_EPWM_LUTCTLB_LUTDEC5_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC5_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC6_MASK                                          (0x00400000U)
#define PWM_EPWM_LUTCTLB_LUTDEC6_SHIFT                                         (0x00000016U)
#define PWM_EPWM_LUTCTLB_LUTDEC6_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC6_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLB_LUTDEC7_MASK                                          (0x00800000U)
#define PWM_EPWM_LUTCTLB_LUTDEC7_SHIFT                                         (0x00000017U)
#define PWM_EPWM_LUTCTLB_LUTDEC7_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLB_LUTDEC7_MAX                                           (0x00000001U)

#define PWM_EPWM_LUTCTLB_RESERVED_3_MASK                                       (0xFF000000U)
#define PWM_EPWM_LUTCTLB_RESERVED_3_SHIFT                                      (0x00000018U)
#define PWM_EPWM_LUTCTLB_RESERVED_3_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_LUTCTLB_RESERVED_3_MAX                                        (0x000000FFU)

#define PWM_EPWM_LUTCTLB_RESETVAL                                              (0x00000001U)

/* RESERVED_80 */

#define PWM_EPWM_RESERVED_80_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_80_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_80_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_80_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_80_RESETVAL                                          (0x00000000U)

/**************************************************************************
* Register Macros
**************************************************************************/

#define PWM_OTTOCAL_HRPWR                                                      (0x00000042U)
#define PWM_OTTOCAL_HRCAL                                                      (0x00000044U)
#define PWM_OTTOCAL_HRPRD                                                      (0x00000046U)
#define PWM_OTTOCAL_HRCNT0                                                     (0x00000048U)
#define PWM_OTTOCAL_HRCNT1                                                     (0x0000004AU)
#define PWM_OTTOCAL_HRMSTEP                                                    (0x0000004CU)

/**************************************************************************
* Field Definition Macros
**************************************************************************/


/* HRPWR */

#define PWM_OTTOCAL_HRPWR_CALMODE_MASK                                         (0x0003U)
#define PWM_OTTOCAL_HRPWR_CALMODE_SHIFT                                        (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALMODE_RESETVAL                                     (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALMODE_MAX                                          (0x0003U)

#define PWM_OTTOCAL_HRPWR_CALSTART_MASK                                        (0x0004U)
#define PWM_OTTOCAL_HRPWR_CALSTART_SHIFT                                       (0x0002U)
#define PWM_OTTOCAL_HRPWR_CALSTART_RESETVAL                                    (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALSTART_MAX                                         (0x0001U)

#define PWM_OTTOCAL_HRPWR_CNTSEL_MASK                                          (0x0008U)
#define PWM_OTTOCAL_HRPWR_CNTSEL_SHIFT                                         (0x0003U)
#define PWM_OTTOCAL_HRPWR_CNTSEL_RESETVAL                                      (0x0000U)
#define PWM_OTTOCAL_HRPWR_CNTSEL_MAX                                           (0x0001U)

#define PWM_OTTOCAL_HRPWR_CALSTS_MASK                                          (0x0010U)
#define PWM_OTTOCAL_HRPWR_CALSTS_SHIFT                                         (0x0004U)
#define PWM_OTTOCAL_HRPWR_CALSTS_RESETVAL                                      (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALSTS_MAX                                           (0x0001U)

#define PWM_OTTOCAL_HRPWR_TESTSEL_MASK                                         (0x0020U)
#define PWM_OTTOCAL_HRPWR_TESTSEL_SHIFT                                        (0x0005U)
#define PWM_OTTOCAL_HRPWR_TESTSEL_RESETVAL                                     (0x0000U)
#define PWM_OTTOCAL_HRPWR_TESTSEL_MAX                                          (0x0001U)

#define PWM_OTTOCAL_HRPWR_CALSEL_MASK                                          (0x03C0U)
#define PWM_OTTOCAL_HRPWR_CALSEL_SHIFT                                         (0x0006U)
#define PWM_OTTOCAL_HRPWR_CALSEL_RESETVAL                                      (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALSEL_MAX                                           (0x000FU)

#define PWM_OTTOCAL_HRPWR_RESERVED_1_MASK                                      (0x7C00U)
#define PWM_OTTOCAL_HRPWR_RESERVED_1_SHIFT                                     (0x000AU)
#define PWM_OTTOCAL_HRPWR_RESERVED_1_RESETVAL                                  (0x0000U)
#define PWM_OTTOCAL_HRPWR_RESERVED_1_MAX                                       (0x001FU)

#define PWM_OTTOCAL_HRPWR_CALPWRON_MASK                                        (0x8000U)
#define PWM_OTTOCAL_HRPWR_CALPWRON_SHIFT                                       (0x000FU)
#define PWM_OTTOCAL_HRPWR_CALPWRON_RESETVAL                                    (0x0000U)
#define PWM_OTTOCAL_HRPWR_CALPWRON_MAX                                         (0x0001U)

#define PWM_OTTOCAL_HRPWR_RESETVAL                                             (0x0000U)

/* HRCAL */

