TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define PWM_OTTOCAL_HRCAL_HRCAL_MASK                                           (0x00FFU)
#define PWM_OTTOCAL_HRCAL_HRCAL_SHIFT                                          (0x0000U)
#define PWM_OTTOCAL_HRCAL_HRCAL_RESETVAL                                       (0x0000U)
#define PWM_OTTOCAL_HRCAL_HRCAL_MAX                                            (0x00FFU)

#define PWM_OTTOCAL_HRCAL_RESERVED_1_MASK                                      (0xFF00U)
#define PWM_OTTOCAL_HRCAL_RESERVED_1_SHIFT                                     (0x0008U)
#define PWM_OTTOCAL_HRCAL_RESERVED_1_RESETVAL                                  (0x0000U)
#define PWM_OTTOCAL_HRCAL_RESERVED_1_MAX                                       (0x00FFU)

#define PWM_OTTOCAL_HRCAL_RESETVAL                                             (0x0000U)

/* HRPRD */

#define PWM_OTTOCAL_HRPRD_HRPRD_MASK                                           (0xFFFFU)
#define PWM_OTTOCAL_HRPRD_HRPRD_SHIFT                                          (0x0000U)
#define PWM_OTTOCAL_HRPRD_HRPRD_RESETVAL                                       (0x0000U)
#define PWM_OTTOCAL_HRPRD_HRPRD_MAX                                            (0xFFFFU)

#define PWM_OTTOCAL_HRPRD_RESETVAL                                             (0x0000U)

/* HRCNT0 */

#define PWM_OTTOCAL_HRCNT0_HRCNT0_MASK                                         (0xFFFFU)
#define PWM_OTTOCAL_HRCNT0_HRCNT0_SHIFT                                        (0x0000U)
#define PWM_OTTOCAL_HRCNT0_HRCNT0_RESETVAL                                     (0x0000U)
#define PWM_OTTOCAL_HRCNT0_HRCNT0_MAX                                          (0xFFFFU)

#define PWM_OTTOCAL_HRCNT0_RESETVAL                                            (0x0000U)

/* HRCNT1 */

#define PWM_OTTOCAL_HRCNT1_HRCNT1_MASK                                         (0xFFFFU)
#define PWM_OTTOCAL_HRCNT1_HRCNT1_SHIFT                                        (0x0000U)
#define PWM_OTTOCAL_HRCNT1_HRCNT1_RESETVAL                                     (0x0000U)
#define PWM_OTTOCAL_HRCNT1_HRCNT1_MAX                                          (0xFFFFU)

#define PWM_OTTOCAL_HRCNT1_RESETVAL                                            (0x0000U)

/* HRMSTEP */

#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_MASK                                       (0x00FFU)
#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_SHIFT                                      (0x0000U)
#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_RESETVAL                                   (0x0000U)
#define PWM_OTTOCAL_HRMSTEP_HRMSTEP_MAX                                        (0x00FFU)

#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_MASK                                    (0xFF00U)
#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_SHIFT                                   (0x0008U)
#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_RESETVAL                                (0x0000U)
#define PWM_OTTOCAL_HRMSTEP_RESERVED_1_MAX                                     (0x00FFU)

#define PWM_OTTOCAL_HRMSTEP_RESETVAL                                           (0x0000U)

/****************************************************************************************************
* Register Definitions
****************************************************************************************************/

#define CSL_EPWM_TBCTL                                            (0x0U)
#define CSL_EPWM_TBSTS                                            (0x2U)
#define CSL_EPWM_RESERVED_1								          (0x4U)
#define CSL_EPWM_TBPHS                                            (0x6U)
#define CSL_EPWM_TBCTR                                            (0x8U)
#define CSL_EPWM_TBPRD                                            (0xaU)
#define CSL_EPWM_RESERVED_2    							          (0xcU)
#define CSL_EPWM_CMPCTL                                           (0xeU)
#define CSL_EPWM_RESERVED_3    							          (0x10U)
#define CSL_EPWM_CMPA                                             (0x12U)
#define CSL_EPWM_CMPB                                             (0x14U)
#define CSL_EPWM_AQCTLA                                           (0x16U)
#define CSL_EPWM_AQCTLB                                           (0x18U)
#define CSL_EPWM_AQSFRC                                           (0x1aU)
#define CSL_EPWM_AQCSFRC                                          (0x1cU)
#define CSL_EPWM_DBCTL                                            (0x1eU)
#define CSL_EPWM_DBRED                                            (0x20U)
#define CSL_EPWM_DBFED                                            (0x22U)
#define CSL_EPWM_TZSEL                                            (0x24U)
#define CSL_EPWM_TZDCSEL								          (0x26U)
#define CSL_EPWM_TZCTL                                            (0x28U)
#define CSL_EPWM_TZEINT                                           (0x2aU)
#define CSL_EPWM_TZFLG                                            (0x2cU)
#define CSL_EPWM_TZCLR                                            (0x2eU)
#define CSL_EPWM_TZFRC                                            (0x30U)
#define CSL_EPWM_ETSEL                                            (0x32U)
#define CSL_EPWM_ETPS                                             (0x34U)
#define CSL_EPWM_ETFLG                                            (0x36U)
#define CSL_EPWM_ETCLR                                            (0x38U)
#define CSL_EPWM_ETFRC                                            (0x3aU)
#define CSL_EPWM_PCCTL                                            (0x3cU)
#define CSL_EPWM_RESERVED_4                                   	  (0x3EU)
#define CSL_EPWM_RESERVED_5 [16U]                          		  (0x40U)
#define CSL_EPWM_DCTRIPSEL									      (0x60U)
#define CSL_EPWM_DCACTL				    				   		  (0x62U)
#define CSL_EPWM_DCBCTL									    	  (0x64U)
#define CSL_EPWM_DCFCTL									    	  (0x66U)
#define CSL_EPWM_DCCAPCTL										  (0x68U)
#define CSL_EPWM_DCFOFFSET										  (0x6AU)
#define CSL_EPWM_DCFOFFSETCNT									  (0x6CU)
#define CSL_EPWM_DCFWINDOW										  (0x6EU)
#define CSL_EPWM_DCFWINDOWCNT									  (0x70U)
#define CSL_EPWM_DCCAP								        	  (0x72U)


                 
                      
/****************************************************************************************************                                                                                                    
* Field Definition Macros
****************************************************************************************************/

