TexasInstruments/mcal_am263x/mcal/include/hw/am261/hw_epwm_reg.h
#define CSL_EPWM_AQSFRC_OTSFA_SHIFT                                                  (2U)
#define CSL_EPWM_AQSFRC_OTSFA_MASK                                                   (0x00000004U)
#define CSL_EPWM_AQSFRC_OTSFA_NO_EFFECT                                              (0U)
#define CSL_EPWM_AQSFRC_OTSFA_SW_EVENT                                               (1U)
																					
#define CSL_EPWM_AQSFRC_ACTSFB_SHIFT                                                 (3U)
#define CSL_EPWM_AQSFRC_ACTSFB_MASK                                                  (0x00000018U)
#define CSL_EPWM_AQSFRC_ACTSFB_DISABLED                                              (0U)
#define CSL_EPWM_AQSFRC_ACTSFB_SET                                                   (2U)
#define CSL_EPWM_AQSFRC_ACTSFB_CLEAR                                                 (1U)
#define CSL_EPWM_AQSFRC_ACTSFB_TOGGLE                                                (3U)
																					
#define CSL_EPWM_AQSFRC_OTSFB_SHIFT                                                  (5U)
#define CSL_EPWM_AQSFRC_OTSFB_MASK                                                   (0x00000020U)
#define CSL_EPWM_AQSFRC_OTSFB_NO_EFFECT                                               (0U)
#define CSL_EPWM_AQSFRC_OTSFB_SW_EVENT                                                (1U)
																					
#define CSL_EPWM_AQSFRC_RLDCSF_SHIFT                                                 (6U)
#define CSL_EPWM_AQSFRC_RLDCSF_MASK                                                  (0x000000c0U)
#define CSL_EPWM_AQSFRC_RLDCSF_CTR_0_OR_PERIOD                                       (2U)
#define CSL_EPWM_AQSFRC_RLDCSF_CTR_0                                                 (0U)
#define CSL_EPWM_AQSFRC_RLDCSF_CTR_PERIOD                                            (1U)
#define CSL_EPWM_AQSFRC_RLDCSF_IMMEDIATE                                             (3U)
																					
#define CSL_EPWM_ETPS_INTPRD_SHIFT                                                   (0U)
#define CSL_EPWM_ETPS_INTPRD_MASK                                                    (0x00000003U)
#define CSL_EPWM_ETPS_INTPRD_DISABLE                                                 (0U)
#define CSL_EPWM_ETPS_INTPRD_GEN_THIRD_EVT                                           (3U)
#define CSL_EPWM_ETPS_INTPRD_GEN_SECOND_EVT                                          (2U)
#define CSL_EPWM_ETPS_INTPRD_GEN_FIRST_EVT                                           (1U)
																					
#define CSL_EPWM_ETPS_INTCNT_SHIFT                                                   (2U)
#define CSL_EPWM_ETPS_INTCNT_MASK                                                    (0x0000000cU)
#define CSL_EPWM_ETPS_INTCNT_EVT_3                                                   (3U)
#define CSL_EPWM_ETPS_INTCNT_NO_EVT                                                  (0U)
#define CSL_EPWM_ETPS_INTCNT_EVT_1                                                   (1U)
#define CSL_EPWM_ETPS_INTCNT_EVT_2                                                   (2U)
																					
#define CSL_EPWM_CMPA_SHIFT                                                          (0U)
                                                                                                                                                                    
#define CSL_EPWM_CMPA_MASK                                                           (0x0000ffffU)
																					
#define CSL_EPWM_ETCLR_INT_SHIFT                                                     (0U)
#define CSL_EPWM_ETCLR_INT_MASK                                                      (0x00000001U)
#define CSL_EPWM_ETCLR_INT_NO_EFFECT                                                  (0U)
                                                                                                                                                                    
#define CSL_EPWM_ETCLR_INT_CLEAR                                                      (1U)
																					
#define CSL_EPWM_AQCSFRC_CSFA_SHIFT                                                  (0U)
#define CSL_EPWM_AQCSFRC_CSFA_MASK                                                   (0x00000003U)
#define CSL_EPWM_AQCSFRC_CSFA_HIGH_OUTPUT                                            (2U)
#define CSL_EPWM_AQCSFRC_CSFA_DISABLED                                               (0U)
#define CSL_EPWM_AQCSFRC_CSFA_LOW_OUTPUT                                             (1U)
#define CSL_EPWM_AQCSFRC_CSFA_NO_EFFECT                                              (3U)
																					
#define CSL_EPWM_AQCSFRC_CSFB_SHIFT                                                  (2U)
#define CSL_EPWM_AQCSFRC_CSFB_MASK                                                   (0x0000000cU)
#define CSL_EPWM_AQCSFRC_CSFB_LOW_OUTPUT                                             (1U)
#define CSL_EPWM_AQCSFRC_CSFB_DISABLED                                               (0U)
#define CSL_EPWM_AQCSFRC_CSFB_NO_EFFECT                                              (3U)
#define CSL_EPWM_AQCSFRC_CSFB_HIGH_OUTPUT                                            (2U)
																					
#define CSL_EPWM_AQCTLB_ZRO_SHIFT                                                    (0U)
#define CSL_EPWM_AQCTLB_ZRO_MASK                                                     (0x00000003U)
#define CSL_EPWM_AQCTLB_ZRO_CLEAR                                                    (1U)
#define CSL_EPWM_AQCTLB_ZRO_DISABLED                                                 (0U)
#define CSL_EPWM_AQCTLB_ZRO_TOGGLE                                                   (3U)
#define CSL_EPWM_AQCTLB_ZRO_SET                                                      (2U)
																					
#define CSL_EPWM_AQCTLB_PRD_SHIFT                                                    (2U)
#define CSL_EPWM_AQCTLB_PRD_MASK                                                     (0x0000000cU)
#define CSL_EPWM_AQCTLB_PRD_CLEAR                                                    (1U)
#define CSL_EPWM_AQCTLB_PRD_DISABLED                                                 (0U)
#define CSL_EPWM_AQCTLB_PRD_TOGGLE                                                   (3U)
#define CSL_EPWM_AQCTLB_PRD_SET                                                      (2U)
																					
